{"created_utc": 1712008178, "title": "Cannot unstake BNB with ledger nano s &amp; trust wallet", "selftext": "Feel like I've been painted into a corner here.  I have BNB on the Binance Beacon Chain, I'm trying to unstake so I can migrate to smart chain but I can't unstake. Trust wallet browser extension (2.9.3) gives me the error:  **\"Cannot read properties of undefined (reading ‘validatorAddress’).\"**  I also can't seem to use anything other than trust wallet to unstake. [bnbchain.org](https://bnbchain.org) forces people to use trustwallet and it's not letting me use the older BNB Chain wallet which I'm sure would work for this as this is what I used to stake in the first place.  What do I do? I've been trying this since yesterday.  I also can't seem to use the trust wallet mobile app because it doesn't support the ledger nano s.It wants a QR code to connect and that's not how ledgers work.", "comments": [{"created_utc": 1711985244.0, "body": "Is there any other app or site I can use other than [bnbchain.org](https://bnbchain.org) to manage staking of my BNB that won't force me to use trust wallet?\n\nIf I can use something that will let me use the older BNB chain wallet that will probably work."}, {"created_utc": 1712333844.0, "body": "Also doesn't work with the Ledger Nano X so this should be easily reproducible."}, {"created_utc": 1712771974.0, "body": "[removed]"}, {"created_utc": 1713797813.0, "body": "Did you ever find out a solution for this? Im in the same boat, im staking my bnb and im connected through my ledger. I tried unstaking through both the old binance wallet and trust wallet. Tried different browsers too. Also cant migrate them either"}]}
{"created_utc": 1712289462, "title": "WBNB on Polygon network", "selftext": "Hello, what is the best way to transfer my WBNB on polygon network to Binance exchange?", "comments": []}
{"created_utc": 1712586127, "title": "Unstaking BNB BEP20 on TrustWallet (BNB chain fusion)", "selftext": "Hello, as I understand, the BNB chain fusion is ongoing and start date is 15-Apr-2024 I am currently staking my BEP2 BNB on Trustwallet (several validators), what should I do now? Should I manually unstake from TW(which will take 7 days, means 15-Apr-2024) or do nothing and my BEP2 BNB will be refunded to the wallet? Please help", "comments": [{"created_utc": 1712561864.0, "body": "Hi. I have some bnb on another exchange, I used bep20 to move them over about a year ago. Could u advise on anything I Shud be aware of. Find this migration thing a little confusing."}, {"created_utc": 1717643349.0, "body": "Did you end up figuring it out? I'm on the same boat. Do you just swap it within the Trust Wallet after 7 days?"}]}
{"created_utc": 1712856680, "title": "Binance Headquarters Up in the Air, CEO Discusses Regulations and Meme Coins", "selftext": NaN, "comments": []}
{"created_utc": 1713223237, "title": "BNB Migration BEP2 to BEP20", "selftext": "I tested the migration on Trust Wallet mobile app and it went through. However, on Binance Smart Chain the transaction shows up as 0 BNB and my balance didn't change on BEP20.      The transaction is listed under Internal Transactions on [bscscan.com](https://bscscan.com) and shows up like all of the transactions listed here: [https://bscscan.com/txs?a=0x0000000000000000000000000000000000002000](https://bscscan.com/txs?a=0x0000000000000000000000000000000000002000)      https://preview.redd.it/tu53fo3thnuc1.png?width=1214&amp;format=png&amp;auto=webp&amp;s=11682761f2bfc2e2e0a9c229b428da0b7818e187  However as I said, it shows as 0 BNB.      https://preview.redd.it/vf5jhuvohnuc1.png?width=1210&amp;format=png&amp;auto=webp&amp;s=5602052caf44ab1cab97ffc6a60d1019f96a5469  Will this resolve once Beacon Chain is shut down? Or is this some type of error? ", "comments": [{"created_utc": 1713192896.0, "body": "I have been curious about certain aspects of this migration. Can I ask you a few questions? \n\n1. Was all your BnB stored on trust wallet?\n2. What network was it on? Beacon or BEP 20\n3. Whats ur wallet address look like , start with bnb or ox etc"}, {"created_utc": 1713195461.0, "body": "I'm not sure what the issue could be but if you are sure that your BnB is on beacon chain then according to Binance you should transfer your BnB to them using beacon chain them withdraw by using Binance Smart Chain. \n\nAlso, beware of scammers on here, I have had quite a few message me on here after I asked some questions about the migration.  They offer to help by making you follow certain fishy links to link your wallet try to scam u of ur coins."}]}
{"created_utc": 1713235053, "title": "Keep Binance-Peg Ethereum token or swap to ETH?", "selftext": "Sorry for the silly question...  I got Binance Token and wondering whether to keep them or swap them to Ethereum?  What would you suggest?  Thank you!", "comments": []}
{"created_utc": 1713263852, "title": "BNB not showing up on UniSwap or Pancake Swap", "selftext": " Hey!   So I purchased some BNB (BNB beacon chain) on trust wallet and it has shown up on my TrustWallet but has not shown up on my Uniswap or Pancake swap (and I have them linked to my wallet).  I’ve been trying to purchase dogo token.  I have tried switching the pairs. I’m a little lost and confused with what to do.  Did I purchase the wrong type of BNB somehow?  Any help would be so appreciated!  Thank you in advance!", "comments": [{"created_utc": 1713233177.0, "body": "I think you had to buy BNB on BNB smart chain not beacon for the wallets to recognize it. Might have to swap out BNB beacon chain for smart chain. BOL"}]}
{"created_utc": 1713301286, "title": "Need help with BnB Chain", "selftext": "Is BnB chain a scam? I tried to make a quick dollar through an Instagram bnb trader a few months back, made a fair profit but unfortunately if I'm to access this profit, they require me to pay a fee which goes to their BnB traders in order for me to withdraw my profit.. But to me it feels wrong paying money in order to withdraw money.. has anyone got experience with BnB trading?? Any information would be helpful thankyou :)   (First time poster)", "comments": [{"created_utc": 1715951223.0, "body": "BnB chain is not scam. The guy who is asking for fee is scammer"}]}
{"created_utc": 1713657510, "title": "Binance Prioritizes Stability, Converts SAFU Funds to USDC ", "selftext": "*Amidst heightened cryptocurrency volatility leading up to the Bitcoin halving, Binance,* [*the world’s leading crypto exchange*](https://cryptolifedigital.com/2022/03/27/breaking-newsjust-yesterday-the-worlds-leading-cryptocurrency-bitcoin-fall-dropped-to-an-intraday-low-of-39621-on-the-bitstamp-exchange-at-801-p-m-utc/)*, has announced a significant change to its emergency insurance fund, the Secure Asset Fund for Users (SAFU).* [Read More](https://cryptolifedigital.com/2024/04/20/binance-prioritizes-stability-converts-safu-funds-to-usdc/)", "comments": []}
{"created_utc": 1713796027, "title": "I need about .50 USD of BNB SC but all Binance blocked in NYC, including in wallet purchases. Bridge?", "selftext": "Any ideas or maybe a trade for Reddit RCC or polygon? ", "comments": []}
{"created_utc": 1713902501, "title": "Is this a good time sell/swap BNB? ", "selftext": "Planning to swap for xrp/BTC/ICP etc...", "comments": []}
{"created_utc": 1713934388, "title": "BNB vs ETH?", "selftext": "Which one has greater upside?", "comments": [{"created_utc": 1713906321.0, "body": "BNB is directly tied to the biggest Crypto Exchange on the planet. ETH is BTC slacking Little Bro."}, {"created_utc": 1713952994.0, "body": "If Bitcoin is digital gold then Eth could now be considered digital silver. There were some issues with SEC but if mainstream corporate investors manage to approve an ETF then we could see ETH go to 10k this bullrun.\n\nBnB has great utility, trading fees, launchpool rewards etc, but legal issues with Binance may hold it back a bit. \n\nEth would give returns with fewer risk but BnB is undervalued and if Binances legal woes are resolved then it could easily do a 5X from current price."}]}
{"created_utc": 1714026821, "title": "BSC chain trust wallet bug", "selftext": "So on the new BNB chain staking site every time I click on 'my staking' it quickly kicks me out and I have to connect wallet again.  Anyone else having this issue? not too comfortable with not being able to see my staked BNB more than half a second. Therefore no way to undelegate.  I'm in chrome on laptop.  And when using the phone in the trust wallet app, there's no option to look at the staked coins (presumably because of the issues they're having) in the BSC address, only in the old Beacon chain address.  Probably bugs they'll figure out soon hopefully. In the meantime, not sure I want to send more BNB from staked in beacon to a validator on BSC chain, knowing I can't even access it for who knows how long", "comments": [{"created_utc": 1713995180.0, "body": "[removed]"}, {"created_utc": 1714001192.0, "body": "i have too many problems in trust wallet recently, for many cases, even a simple swap between BSC to BNB, its updated wallet, have anyone information about it?"}, {"created_utc": 1714168468.0, "body": "Trust wallet is super buggy and it's made worse by the fact that the staking page is trying to force users to select the trust wallet extension. Luckily there's a way around that that. Go directly on the staking page with the BNB Chain Wallet extension installed and trust wallet disabled and it should prompt you with BNB Chain wallet extension. No use doing this via the connect button as this is what tries to load the trust wallet."}]}
{"created_utc": 1714027714, "title": "Constant spinner when trying to migrate BNB using trust wallet browser extension 2.10.0 + hardware wallet?", "selftext": "This is like the second blocking bug I've discovered on trust wallet using a ledger nano x now:man_facepalming:  The migrate button is stuck showing a spinner.  https://preview.redd.it/x1jpiub7zhwc1.png?width=790&amp;format=png&amp;auto=webp&amp;s=7468027066a355816c6c124cb1f91a1139f14d55  Trust wallet support is useless (I tried this method last time).  I sent 0.01 BNB to the smart chain using the old BNB Chain wallet which shows a successful transaction but the amount doesn't show up on trustwallet so I'm kinda concerned about that. It was just a test amount before I sent it all over. Is there any expected delay for this?  Anyone know about this?  Another thing that concerns me is that trust wallet wants to migrate the full amount in one go and to be quite frank even if this did work I'd prefer to send a test amount first considering the past migration bug reported in this sub.", "comments": []}
{"created_utc": 1714079930, "title": "Baked beans on BNB serious income", "selftext": "Check out baked beans. This exploded last bull market and is way early. Passive income through BNB. I recommend getting in before it says 5000 beans on the contract. You can literally generate $1000 a day. Please do your own research. This is not a scam. But early investors will be rewarded the most.  Link - https://bakedbeans.app?ref=0xd55Cf63593dfdE5B5f358F9C041782ACE66368dd", "comments": [{"created_utc": 1717443406.0, "body": "Baked Beans App is BS!"}]}
{"created_utc": 1714189406, "title": "Staking csv with USD", "selftext": "Hi,  Is there a free staking csv generator that provides usd values along with bnb?", "comments": []}
{"created_utc": 1714339679, "title": "CoinCurrently: Widgets", "selftext": NaN, "comments": [{"created_utc": 1714307288.0, "body": "Just wanted to show some of the widgets I’ve created for my app. There’s 21 home screen widgets and 13 lock screen widgets in total, with 4 different selectable color schemes. Been working on this hobby project for close to 3.5 years now. What do you think of the widgets, find them useful? Have a great weekend!\n\nwww.coincurrently.app"}, {"created_utc": 1714343383.0, "body": "I‘ll download and try it :)"}]}
{"created_utc": 1714351448, "title": "Sent bnb from trust wallet to kucoin but not arrived it's been one hour why ?", "selftext": NaN, "comments": [{"created_utc": 1714343079.0, "body": "It‘s gone"}]}
{"created_utc": 1714356416, "title": "Baked Beans Reloaded dApp", "selftext": "They are back after 3 years Join this Project to gain 8% daily.  ", "comments": []}
{"created_utc": 1714542121, "title": "Binance CEO CZ Sentenced to Four Months in Prison, BNB Drops for BINANCE:BNBUSDT by DEXWireNews", "selftext": NaN, "comments": []}
{"created_utc": 1714645167, "title": "BnB to BSC", "selftext": "I havent looked at my wallet lately then i see this? Currently staked bnb. Whats the play here unstake then swap on TW? Thank you for the help. ", "comments": [{"created_utc": 1714617374.0, "body": "I also have my bnb staked on the beacon chain. But unfortunately I recently swapped my rewards to the smart chain. Now I don’t have enough bnb on beacon to unstake my coins. I’ve been trying to swap from bsc but the tx keeps failing. \nAnyone have any suggestions? \n*edited for typos"}, {"created_utc": 1714931743.0, "body": "I messaged someone on Reddit and asked if they’d send me some beacon chain for my txs and then I sent them double that back on bsc. Fortunately they agreed."}]}
{"created_utc": 1714808250, "title": "Make money", "selftext": "Hi guys i want to use conti clips to make money, but I don't have any, if u can help i will be thankful. ID:890853678 Tron TC8N29EApaeCvqGw2oPZHC4cKkdNZxVWaA", "comments": []}
{"created_utc": 1714826411, "title": "Baked beans is back! Passive income", "selftext": "Check out baked beans. This exploded last bull market and is way early. Passive income through BNB. I recommend getting in before it says 5000 beans on the contract. You can literally generate $1000 a day. Please do your own research. This is not a scam. But early investors will be rewarded the most.  Link - https://bakedbeans.app?ref=0xd55Cf63593dfdE5B5f358F9C041782ACE66368dd", "comments": []}
{"created_utc": 1714868855, "title": "Sending USDT not finishing to Exodus from an exchange on the BNB network.", "selftext": "I tried to send USDTs from Nexo (selecting \"Binance Smart Chain (BEP20)\") to Exodus (selecting \"BNB Smart Chain network\"), but it still doesn't show up on Exodus (taking 4 hours or so this far).  I contacted Nexo first, the CS told me on the Nexo side the sending is succeeded on the Nexo end.  I googled, people say bsc = bep20 right? Then no way that either of the networks is wrong, I'm correct, right?  Umm, what I can do? Thanks.  Note: I tried to post on r/ExodusWallet but the mods were no response as https://www.reddit.com/r/ExodusWallet/comments/1cj11qb/sending_usdt_not_finishing_to_exodus_from_an/ so thought asking here. ", "comments": []}
{"created_utc": 1715082047, "title": "TW no longer supported BnB?", "selftext": "Beacon chain is shutting down on trust wallet ? I have somehow 0.22 staked I can’t unstake because you need 1 to unstake. So do I need to send over .8 to TW stake it to just to unstake it fully ?  ", "comments": [{"created_utc": 1715052220.0, "body": "I am in the same situation but need 0.0005 bnb to unstake.  Can someone help me out by sending 0.0005 beacon coin?  I will send double or triple back when unstake or in another currency."}, {"created_utc": 1715053326.0, "body": "See this, you will need to migrate accordingly: [https://www.bnbchain.org/en/bnb-chain-fusion](https://www.bnbchain.org/en/bnb-chain-fusion)\n\nThe old staking site should allow you to migrate to the new staking site:\n\n**Old**: [https://www.bnbchain.org/en/staking](https://www.bnbchain.org/en/staking)\n\n**New**: [https://www.bnbchain.org/en/bnb-staking](https://www.bnbchain.org/en/bnb-staking)"}, {"created_utc": 1715058513.0, "body": "Just create a Binance Smart Chain wallet and send the BNB on Beacon Chain over to the address you created on BSC. Then the migration is done.\n\nCould you please check your dms? You could really help me a lot. Thank you."}, {"created_utc": 1715062550.0, "body": "How do you know which chain the BNB u own is own?"}, {"created_utc": 1715123771.0, "body": "[ Removed by Reddit ]"}, {"created_utc": 1715388256.0, "body": "Just swapped BNB to BSC on TW but i dont see stake option for BSC…\nWill there be staking BSC on TW at all ?"}]}
{"created_utc": 1715171558, "title": "Not receiving staking rewards after doing BNB Fusion migration from BNB Beacon Chain to BNB Smart Chain?!", "selftext": "I did the BNB Fusion migration from BNB Beacon Chain to BNB Smart Chain over 10 days ago, restaking coins into active validators (Legend I-IV validators). I have not received any rewards yet, why?  I followed these docs: [https://www.bnbchain.org/en/bnb-chain-fusion](https://www.bnbchain.org/en/bnb-chain-fusion)  Old staking site: [https://www.bnbchain.org/en/staking](https://www.bnbchain.org/en/staking)   New staking site: [https://www.bnbchain.org/en/bnb-chain-fusion](https://www.bnbchain.org/en/bnb-chain-fusion)", "comments": [{"created_utc": 1715752104.0, "body": "Same. I migrated and have not received anything."}, {"created_utc": 1715776106.0, "body": "Same here"}, {"created_utc": 1715848332.0, "body": "I have double-checked today and looks like I am getting the staking rewards. I didn't notice before because the rewards are being automatically delegated again. If you check the amount delegated is increasing every day."}, {"created_utc": 1722008307.0, "body": "[removed]"}]}
{"created_utc": 1715222652, "title": "Small bnb for swap fee. ", "selftext": "Could someone PLEASE send me a small anount of bnb on bnb chain for swap fee.. PLEASE  coastalconsulting.eth ", "comments": [{"created_utc": 1715214214.0, "body": "I am in the same situation as well.  Need .005 bnb chain to unstake.  Can someone send that to me and I will return double once unstaked"}]}
{"created_utc": 1715319181, "title": "BNB Chain Announces 4 Upcoming Hard Forks on opBNB to Reduce Gas Cost by 10x", "selftext": NaN, "comments": []}
{"created_utc": 1715341638, "title": "BNB Migration from Beacon Chain to Smart Chain", "selftext": "Hi there yesterday I migrated my BNB from the Beacon Chain to Smart Chain, but I can´t even display my BNB from the Smart Chain n Trustwallet. When I´m in my Trustwallet it just says that the BNB Smart Chain will be available soon and I cant activate BNB for Smart Chain. On the Blockchain explorer I can see that the transaction went through. Do you have any suggestions how I can see my BNB on the Smart Chain in TrustWallet?", "comments": []}
{"created_utc": 1715343899, "title": "Help! Can't unstake bnb beacon chain", "selftext": "Hi, I have bnb beacon chain tokens staked but don't have any bnb beacon chain tokens to unstake. It's in a bnb wallet with the trust app. Is there any way to get bnb beacon chain tokens so that I can unstake?  I tried to convert bnb smart chain to bnb beacon but it keeps failing.  Would like to unstake so before bnb beacon chain gets phased out.  TIA  https://preview.redd.it/rnon90ikpizc1.jpg?width=1170&amp;format=pjpg&amp;auto=webp&amp;s=5514c2f59fb1ac8bbb3024efc7b0542dbb031baf  ", "comments": [{"created_utc": 1715312000.0, "body": "[removed]"}, {"created_utc": 1715313690.0, "body": "Do you have any smart chain? If you do just find someone to send you beacon chain and you can send them bsc."}, {"created_utc": 1715615356.0, "body": "Answer is simple. I spent two days figuring this out. Simpleswap.io is your answer. in my case, I used a VPN because USA based but it may not matter. \nUse the smartswap.io to switch out for any coin for BNB Beacon chain. \nNot going to completely explain how to use smart swap. There’s videos on it. It’s easy. It seems sketchy. But it works. It has been vetted by coin bureau. \nIn my case, I used LTC.  Basically input your information of your trust wallet address for BnB Beacon chain. You will then send in $15 worth of ltc. And then about five minutes and for a small fee you get back beacon chain. Then use that to unstake."}, {"created_utc": 1724512175.0, "body": "Did you get help?"}, {"created_utc": 1725659403.0, "body": "So I'm late on this miragration and learning im out my money. "}]}
{"created_utc": 1715382584, "title": "Binance - BNB Technical Analysis for May 10 , 2024 - Binance Coin", "selftext": NaN, "comments": []}
{"created_utc": 1715410214, "title": "Binance Officially Registers With Indian Regulator for $260 Bln for BINANCE:BNBUSDT by DEXWireNews", "selftext": NaN, "comments": []}
{"created_utc": 1715774978, "title": "I have ETH, VET, DOT, MATIC in Trust Wallet... do I need to move any of them for migration?", "selftext": "I have BNB staked that I am already planning to migrate to BSC. Will I lose my ETH, VET, DOT or other ERC assets like ZRX and SUSHI in my Trust Wallet if I dont do anything to them/swap?", "comments": [{"created_utc": 1715743149.0, "body": "[removed]"}, {"created_utc": 1715750748.0, "body": "Any process to ensure which chain ur bnb is stored on? If it's Smart chaim then the address would be starting with Ox right?"}]}
{"created_utc": 1715804310, "title": "Help with staking on BSC and Ledger Nano S", "selftext": "Hey,  I can't find a helpful tutorial to stake BNB on BSC with my Ledger Nano S. I tried it on my own:  - Installed BSC Wallet on Ledger Live   - Sent BNB to BSC Address on Ledger Live   - Go on [https://www.bnbchain.org/en/bnb-staking](https://www.bnbchain.org/en/bnb-staking) and connect the Ledger with Wallet Connect in Ledger Live   - Click delegate and input the amount   - Approve everything on the Ledger with Blind Signing activated   - I get an error message on [bnbchain.org](http://bnbchain.org) and the transaction doesn't work  Same with Trust Wallet. I can't connect my Ledger with Trust Wallet as it only shows bnb1... addresses (so Beacon Chain) to select.  Is there anywhere a guide or tutorial that can help me?  ", "comments": [{"created_utc": 1717421836.0, "body": "Same here, Installed BSC Wallet on Ledger Live, sent BNB there\n\nHow can I delegate? I have been looking for weeks.. I can´t find information, the few questions I find have no good answers. Not many users complaining.. I wonder how others have achieved delegation on the binance smart chain?"}]}
{"created_utc": 1715805488, "title": "Rant on BNB and its wallets. What a bad UX.", "selftext": "[I just created a thread as I am looking for help with BSC staking with my Ledger Nano S.](https://www.reddit.com/r/BNBinance/comments/1csibhb/help_with_staking_on_bsc_and_ledger_nano_s/)     This is another post that criticizes the usability of BNB and its chains.  I bought BNB back in 2018 so I have been a hodler for more than 6 years. The gains are insane but using BNB and its networks/chains is just painful.   First of all, the two networks the whole time were very confusing. Beacon Chain this, Binance Smart Chain that. You can only stake on this one, this token is on that one etc...      Now we are moving to BSC only, which is fine. But the whole migration process is so complicated. Everywhere on Twitter, Reddit and other forums, users are complaining. Tokens can't be migrated from Beacon Chain to BSC without BNB. The trap is that you also can't buy any BNB on Beacon Chain anymore. So you have to find someone that still has BNB on Beacon chain and is willing to send you some to proceed with the migration. You also can't unstake withouth BNB. That's bullshit. Who the fuck came up with that?  Then there is no possibility to complete the migration from a Ledger Nano S to the same Ledger Nano S. I can imagine that this is also the case with other hardware wallets. So you need to unstake, send everything to your Ledger's BSC address and delegate again.  The Beacon Chain staking site might show you the option to connect a wallet, but you can't select whether you want to connect to the BNB chain wallet or to Trust wallet. So you can't use both in one browser. Are you kidding me?  The Trust wallet browser extension is so shitty, you can't even import a single private key - only a seed phrase. I need to use my insecure Android phone to do that. What the fuck is that?   Also it seems like you can't use Ledger with Trust wallet, as it is only available for Beacon Chain?   There is still no possibility to bridge to BTC in a decentralized way so everyone needs to use expensive services like FixedFloat.  The UX is so shitty that you can almost think that they are doing that on purpose. What's wrong with Binance? Why don't they invest in easy to use apps? The old BNB chain wallet is still listed as an official wallet on [bnbchain.org](http://bnbchain.org) althoug users should use Trust Wallet now. Then you download Trust wallet and it is not a bit better.  I spent at least 20 hours in the last 3 weeks to migrate all tokens and delegations in a way to still maintain my privacy and this is so exhausting because nothing works. I really wanted to sell everything because I am so fed up.", "comments": [{"created_utc": 1715792013.0, "body": "The delegation site makes you use trust wallet for everything but there's a work around. [See here](https://www.reddit.com/r/CryptoCurrency/s/RlBXyZlzv1).\n\nTrust wallet web extension did not work for me on anything staking related with a hardware wallet.\n\nAnd yes the whole process made me question whether I still want to keep my BNB. Trust wallet web extension is bad. I spent like 2 weeks dealing with this."}]}
{"created_utc": 1715880763, "title": ":rocket::briefcase: Exciting News for BNB Holders! Binance Coin Surges 3% Amid Spot Trading Update :chart_increasing::fire:", "selftext": NaN, "comments": []}
{"created_utc": 1715906481, "title": "GetBlock meets opBNB nodes! ", "selftext": "Great news to the BNB Chain community! GetBlock now supports opBNB nodes! :fire:   GetBlock now offers robust support for OpBNB nodes, delivering fast and reliable access tailored specifically for you.  Shared or dedicated RPC node connections, we've got you covered! :handshake:  https://preview.redd.it/2c336b9p6t0d1.jpg?width=4096&amp;format=pjpg&amp;auto=webp&amp;s=aed28ea7f65e68eb9aa65122cb963d049bf09387  ", "comments": []}
{"created_utc": 1716525841, "title": "Seeking advice. Lost BNB", "selftext": "Hello, a while ago I tried to send some BNB to my Metamask wallet through the Harmony Bridge but I can't see it in my wallet. The amount was 5.3085 BNB  Have I just lost this into oblivion? Or is there any way I can retrieve my BNB?  From: 0x7a3fBf3D819186635ac2eE683F392940Bc26D990  To: 0xfD53b1B4AF84D59B20bF2C20CA89a6BeeAa2c628  Transaction hash: 0x03e3eb32f0f556a4a0d9008e57a6de9e9c225a676cd1c768b1370127730c6f6d", "comments": []}
{"created_utc": 1716663176, "title": "How to get BSC Testnet tokens to MetaMask?", "selftext": "Hey folks,  I wanted to get some Test BNB on my MetaMask and used those BNB Chain Testnet parameters from the tutorial from binance academy to create the right network.  But unfortunately, when putting in my wallet address into the bnb faucet, the tool is loading like forever and nothing's happening.  Can anyone help me here?", "comments": []}
{"created_utc": 1717192581, "title": "Popular Crypto: Narratives, Trends &amp; News | Retire on BNB | AI based For...", "selftext": NaN, "comments": []}
{"created_utc": 1717285513, "title": "Binance Coin Price Pattern Set for Breakout is $900 Inevitable? for BINANCE:BNBUSDT by DEXWireNews", "selftext": NaN, "comments": [{"created_utc": 1717300047.0, "body": "Man, will this be the future for Creso?"}]}
{"created_utc": 1717305686, "title": "Win win ", "selftext": NaN, "comments": []}
{"created_utc": 1717381276, "title": "Free BNB faucet", "selftext": "Put in your wallet and then instant withdrawal no referrals or anything necessary. But it does speed it up. ", "comments": []}
{"created_utc": 1717418931, "title": "Launched my first successful Honeypot/Rug Pull token yesterday AMA", "selftext": "Ask me anything. ", "comments": [{"created_utc": 1717394107.0, "body": "Made any money?"}, {"created_utc": 1717446732.0, "body": "Can u provide a description for beginners on how u went about doing it and was ur profitable for you in any way? Thanks"}]}
{"created_utc": 1717454360, "title": "Google Chrome Plugin Scam Drains Over $1M from Binance Account", "selftext": NaN, "comments": []}
{"created_utc": 1717618589, "title": "Binance Coin Reaches New All-Time High", "selftext": NaN, "comments": [{"created_utc": 1717600543.0, "body": "What's your price prediction for this bull run on BNB?"}]}
{"created_utc": 1717620399, "title": "Binance Coin breaks $700, registers new all-time high", "selftext": NaN, "comments": []}
{"created_utc": 1717623724, "title": "How can i claim my dogeverse? ", "selftext": "Can somebody help me please?  I added the tokken but the Balance is Zero ", "comments": [{"created_utc": 1717618244.0, "body": "I have the same problem. When I try to claim on the site, it says check your wallet, but I see no info or any option to allow or anything."}, {"created_utc": 1717859661.0, "body": "I have the same problem, it comes out 0 having done the steps perfectly and I also have balance to pay the fees. I'm getting desperate because the money is reflected on the dogeverse website"}, {"created_utc": 1717955281.0, "body": "I have the same issue for trust wallet bnb!"}]}
{"created_utc": 1717642147, "title": "Trust wallet Beacon Chain Staking", "selftext": "I don’t check BNB that often. Just saw the notice inside Trust Wallet to migrate to the Smart Chain. I just initiated my unstaking but will take 7 days. Will I have enough time to migrate after that before this is gone?  ", "comments": []}
{"created_utc": 1717646390, "title": "BNB to BSC unstake ", "selftext": "I've been out of the loop and just learned about the BSC chain swap on the 3rd, I have several BNB being staked in trust wallet, and started the unstaking process at 9:30 pm EST on June 3rd, will my BNB be transferable to the BSC chain in time before the beacon chain sunset? Please tell me I'm not F'd", "comments": [{"created_utc": 1717614288.0, "body": "[deleted]"}, {"created_utc": 1717637456.0, "body": "Yeah same boat. I have a lot of BNB in staking and was completely out of it. Big mistake. Crypto is such a volatile world, we need to be constantly checking everything. Just by random chance read something about BNB migration. I unstaked it last Thursday, so I'm hoping I can complete the swap tomorrow. I reached out to Binance support to see if there was a deadline but all they said was \"By June\" so feel like you should be good."}, {"created_utc": 1717660125.0, "body": "Go here to get up to speed: [https://www.bnbchain.org/en/bnb-chain-fusion](https://www.bnbchain.org/en/bnb-chain-fusion)\n\nThe old staking site has a migrator: [https://www.bnbchain.org/en/staking](https://www.bnbchain.org/en/staking)\n\nNew staking site: [https://www.bnbchain.org/en/bnb-staking](https://www.bnbchain.org/en/bnb-staking)"}, {"created_utc": 1717784708.0, "body": "If you need answers more quickly. There is an active group on telegram \n“Bnb chain community” if you look in the list of members you’ll see some marked as “admin” if you DM one or two of those folks you should be able to get an answer. \nObviously don’t reply to anyone who DMs you even if they have the same avatar and name as an admin. They’re trying to scam you. \n\nHope this helps, also I see the note that after beacon chain terminates staked tokens might be auto migrated. This seems to be at odds with the warning about loss of funds. \nI find it unlikely that bnb would default to making hodlers loose their coins. But wtf do I know?"}, {"created_utc": 1718072197.0, "body": "Alright it’s unstaked but now it gives me the error “amount should be positive” no matter how much I try to move to bsc chain"}]}
{"created_utc": 1717805364, "title": "Binance - BNB Technical Analysis for June 7 , 2024 - Binance Coin", "selftext": NaN, "comments": []}
{"created_utc": 1717931571, "title": "BNB set New ATH", "selftext": "Thanks to https://www.radiant.magpiexyz.io/stake I bought BNB just to enjoy the APR rewards from Magpiexyz. But at the moment I'm enjoying the APR plus good gains in price of BNB.   You can check Magpiexyz.io on defillama.com DYOR.", "comments": []}
{"created_utc": 1717979479, "title": "Selling BNB in Canada", "selftext": "I live in Canada and received some BNB on the Binance website a couple years ago through a friend (I just gave him cash and he transferred me the BNB to my wallet). I'm not very savvy in terms of crypto and have no idea how to actually get my money. I also understand that binance no longer operates in the Canadian market. Can anyone explain to me how I can eventually sell it and and deposit the $ in CAD to my bank account?", "comments": [{"created_utc": 1717956711.0, "body": "I will trade you. Dont trust any dms"}, {"created_utc": 1718048104.0, "body": "You can trade your BNB on all exchanges that still operate in Canada or find a trustworthy individual that will give you $$$ for your BNB."}, {"created_utc": 1718305330.0, "body": "I'm willing to send you cash for some ($5) of that bnb. Is it on bep20? \nSee, I'm also in pickle. I can't do any transfers because I don't have enough bnb and can't buy any bnb (also in Canada). \nI can send you the money via interac transfer. Let me know if you're interested. If that goes well maybe I'll buy more."}, {"created_utc": 1728969708.0, "body": "I want to know how can i buy usdt in canada"}]}
{"created_utc": 1718083335, "title": "Binance ", "selftext": "Solana Validators Face Penalties for Alleged Economic Attacks https://app.binance.com/uni-qr/cart/9291997376521?r=527648310&amp;l=en&amp;uco=P1xs9KBvm4wIuCTP6_Qfww&amp;uc=app_square_share_link&amp;us=more ", "comments": [{"created_utc": 1736750512.0, "body": "Can I ask sommetning thet interest me personally not toliko nesesery"}]}
{"created_utc": 1718138939, "title": "Launched my first successful Honeypot/Rug Pull token yesterday, AMA ", "selftext": NaN, "comments": []}
{"created_utc": 1718212696, "title": "BNB for Gas Fees", "selftext": "Hello BNB Blockchain! I am hoping someone has some ideas of how someone could get a small amount of BNB to cover gas fees? Any Websites, Apps, Faucets, Airdrops, Or Anything else that would help someone in a bit of a pickle :cucumber:  Any suggestions would be greatly appreciated :thumbs_up: Thanks  ", "comments": [{"created_utc": 1718313084.0, "body": "Looking  for same thing..Need a $1 USD worth."}, {"created_utc": 1718954757.0, "body": "Same boat! How to get some BNB beacon chain to migrate to smart chain??"}, {"created_utc": 1721772906.0, "body": "Same here I need $4 worth, I’m in Canada and I can’t seem to be able to buy it anymore and"}]}
{"created_utc": 1718214277, "title": "honeypot rug pull token", "selftext": "Deploy from Github: [https://github.com/0xvnknown/how-to-create-a-honeypot-token](https://github.com/0xvnknown/how-to-create-a-honeypot-token)  ", "comments": []}
{"created_utc": 1718244164, "title": "HELP:  How do I convert BNB on ETH chain to BNB on Binance chain?", "selftext": "When Binance offered  BNB tokens back in 2017, they were on Ethereum chain.   Then they came out with their own chain around 2019.    I still have some of the old tokens that I would like to convert.  I'm coming up empty on google.  Any help is appreciated. ", "comments": [{"created_utc": 1718629828.0, "body": "I have some too on Coinbase wallet."}, {"created_utc": 1718632070.0, "body": "Use a DEX like Uniswap"}, {"created_utc": 1720009251.0, "body": "Were able to figure this out? I’m having a similar issue getting BNB beacon chain out of a stake on of trust wallet due to lack of unstaked beacon coin to serve as gas"}, {"created_utc": 1720110212.0, "body": "Per [Binance](https://www.binance.com/en-ZA/square/post/10262025824722) “Staked BNB: If you have staked BNB, this needs to be migrated. If it is not migrated before July 14, it will be automatically unstaked and return to your account in 2 weeks.”"}]}
{"created_utc": 1719381111, "title": "Podcast DEX ETF", "selftext": "#Podcast #Criptomoedas #DeFi #DEXETF #Metaverso", "comments": []}
{"created_utc": 1719593833, "title": "Unstaking BEP2 token before Sunset ", "selftext": "Hi all   I just gotten news last week that BEP2 support will be removed for Trust Wallet.   On the 21st June I decided to unstake what BNB tokens I had it was staked under Legend 3 Delegator.   Anyways I heard that it takes 7 days to unstake and it's the 28th now , not exactly sure why but it is still unstaking.   With that said does delays for unstaking happen? And also when will the support for BEP2 end ? As it doesn't seem to be listed  ", "comments": [{"created_utc": 1719562471.0, "body": "Did you get to unstake yet"}, {"created_utc": 1719603193.0, "body": "From what I’ve seen the unstake will be there after 8pm ET on the 7th day"}, {"created_utc": 1719624832.0, "body": "Surprisingly it got out a few hours later. \n\nWhat a relieve, swapped all to BSC and will await the update"}]}
{"created_utc": 1719704389, "title": "Beggar", "selftext": "Beggar", "comments": [{"created_utc": 1719672088.0, "body": "0xCAA5Cb8eFD0d181f96dD68704Ab8fc044d2cd434"}]}
{"created_utc": 1719976128, "title": "Landmark Ruling: US Court Dismisses Key SEC Claims Against Binance in a Win for Crypto Industry", "selftext": NaN, "comments": []}
{"created_utc": 1720042601, "title": "Paper detailing BitPower Loop’s security", "selftext": "Security Research of BitPower Loop  BitPower Loop is a decentralized lending platform based on blockchain technology, dedicated to providing users with safe, transparent and efficient financial services. Its core security comes from multi-level technical measures and mechanism design, which ensures the robust operation of the system and the security of user funds. This article will introduce the security of BitPower Loop in detail from five aspects: smart contract security, decentralized management, data and transaction security, fund security and risk control mechanism.    1. Smart Contract Security  Smart contracts are the core components of BitPower Loop, and their codes must undergo strict security audits before deployment. These audits are usually conducted by third-party independent security companies to ensure that there are no vulnerabilities or malicious code in the contract. In addition, the immutability of smart contracts means that once deployed, no one (including the development team) can modify its rules and logic, which fundamentally eliminates the possibility of malicious operations. All operations are automatically executed by smart contracts, avoiding the risk of human intervention and ensuring the fairness and consistency of system operation.    2. Decentralized Management  BitPower Loop eliminates the risks brought by single point failures and central control through decentralized management. The system has no central management agency or owner, and all transactions and operations are jointly verified and recorded by blockchain nodes distributed around the world. This decentralized structure not only improves the system's anti-attack capabilities, but also enhances transparency. Users can publicly view all transaction records, which increases trust in the system.    3. Data and transaction security  BitPower Loop uses advanced encryption technology to protect users' data and transaction information. All data is encrypted during transmission and storage to prevent unauthorized access and data leakage. The consensus mechanism of the blockchain ensures the validity and immutability of each transaction, eliminating the possibility of double payment and forged transactions. In addition, the automated execution of smart contracts also avoids delays and errors caused by human operations, ensuring the real-time and accuracy of transactions.    4. Fund security  The secure storage of user funds is an important feature of BitPower Loop. Funds are stored on the blockchain through smart contracts and maintained by nodes across the entire network. Distributed storage avoids the risk of fund theft caused by centralized storage. In addition, the user's investment returns and shared commissions are automatically allocated to the user's wallet address by the smart contract after the conditions are met, ensuring the timely and accurate arrival of funds.    5. Risk Control Mechanism  BitPower Loop effectively manages lending risks by setting collateral factors and liquidation mechanisms. The collateral factors are independently set according to market liquidity and asset value fluctuations to ensure system stability and lending security. When the value of the borrower's assets falls below a certain threshold, the liquidation mechanism is automatically triggered, ensuring the repayment of the borrower's debt and protecting the interests of the fund provider. In addition, the immutability and automatic execution characteristics of smart contracts further enhance the security and reliability of the system.    Conclusion  BitPower Loop achieves high security and stability through multi-level security measures and mechanism design. Its smart contracts are strictly audited and immutable, decentralized management eliminates single point failure risks, advanced encryption technology protects data and transaction security, distributed storage ensures fund security, and risk control mechanisms manage lending risks. These security features together build a reliable decentralized financial platform that provides users with secure, transparent and efficient financial services.", "comments": []}
{"created_utc": 1720130052, "title": "Unstaking BNB beacon", "selftext": NaN, "comments": []}
{"created_utc": 1720130219, "title": "Paper detailing BitPower Loop’s security", "selftext": "Security Research of BitPower Loop  BitPower Loop is a decentralized lending platform based on blockchain technology, dedicated to providing users with safe, transparent and efficient financial services. Its core security comes from multi-level technical measures and mechanism design, which ensures the robust operation of the system and the security of user funds. This article will introduce the security of BitPower Loop in detail from five aspects: smart contract security, decentralized management, data and transaction security, fund security and risk control mechanism.    1. Smart Contract Security  Smart contracts are the core components of BitPower Loop, and their codes must undergo strict security audits before deployment. These audits are usually conducted by third-party independent security companies to ensure that there are no vulnerabilities or malicious code in the contract. In addition, the immutability of smart contracts means that once deployed, no one (including the development team) can modify its rules and logic, which fundamentally eliminates the possibility of malicious operations. All operations are automatically executed by smart contracts, avoiding the risk of human intervention and ensuring the fairness and consistency of system operation.    2. Decentralized Management  BitPower Loop eliminates the risks brought by single point failures and central control through decentralized management. The system has no central management agency or owner, and all transactions and operations are jointly verified and recorded by blockchain nodes distributed around the world. This decentralized structure not only improves the system's anti-attack capabilities, but also enhances transparency. Users can publicly view all transaction records, which increases trust in the system.    3. Data and transaction security  BitPower Loop uses advanced encryption technology to protect users' data and transaction information. All data is encrypted during transmission and storage to prevent unauthorized access and data leakage. The consensus mechanism of the blockchain ensures the validity and immutability of each transaction, eliminating the possibility of double payment and forged transactions. In addition, the automated execution of smart contracts also avoids delays and errors caused by human operations, ensuring the real-time and accuracy of transactions.    4. Fund security  The secure storage of user funds is an important feature of BitPower Loop. Funds are stored on the blockchain through smart contracts and maintained by nodes across the entire network. Distributed storage avoids the risk of fund theft caused by centralized storage. In addition, the user's investment returns and shared commissions are automatically allocated to the user's wallet address by the smart contract after the conditions are met, ensuring the timely and accurate arrival of funds.    5. Risk Control Mechanism  BitPower Loop effectively manages lending risks by setting collateral factors and liquidation mechanisms. The collateral factors are independently set according to market liquidity and asset value fluctuations to ensure system stability and lending security. When the value of the borrower's assets falls below a certain threshold, the liquidation mechanism is automatically triggered, ensuring the repayment of the borrower's debt and protecting the interests of the fund provider. In addition, the immutability and automatic execution characteristics of smart contracts further enhance the security and reliability of the system.    Conclusion  BitPower Loop achieves high security and stability through multi-level security measures and mechanism design. Its smart contracts are strictly audited and immutable, decentralized management eliminates single point failure risks, advanced encryption technology protects data and transaction security, distributed storage ensures fund security, and risk control mechanisms manage lending risks. These security features together build a reliable decentralized financial platform that provides users with secure, transparent and efficient financial services.", "comments": []}
{"created_utc": 1720252389, "title": "Are these Binance points worth anything? (if I get them)", "selftext": NaN, "comments": []}
{"created_utc": 1720302712, "title": "BitPower: Exploring the Future of Decentralized Finance", "selftext": "Introduction  In the era of rapid development of modern financial technology, decentralized finance (DeFi) has become an emerging force that subverts traditional financial services. As an innovative project in this field, BitPower is committed to providing users with more transparent, efficient and secure financial services through blockchain technology and smart contracts. This article will introduce in detail the basic concepts, core technologies, security, and applications and advantages of BitPower in the financial field.    Basic Concepts  BitPower is a decentralized lending platform developed based on blockchain technology, aiming to break the barriers of the traditional financial system and provide more flexible and low-cost financial services. BitPower is built on the Ethereum network (EVM) and uses smart contract technology to realize asset deposits and lending. Participants can deposit digital assets on the platform to earn interest or obtain loans by mortgaging assets.    Core Technology  Smart Contract  The core of BitPower lies in smart contract technology. A smart contract is a self-executing code that can automatically perform predefined operations when specific conditions are met. On the BitPower platform, all deposit and lending operations are controlled by smart contracts to ensure the security and transparency of transactions.    Decentralization  BitPower adopts a decentralized architecture without a central control agency. All transaction records are stored on the blockchain and maintained by all nodes in the network. This decentralized approach not only improves the system's anti-attack capabilities, but also ensures the transparency and immutability of the data.    Consensus Mechanism  The BitPower platform uses the consensus mechanism of the blockchain to ensure the validity and consistency of transactions. Through consensus algorithms such as Proof of Work (PoW) or Proof of Stake (PoS), nodes in the network can reach a consensus to ensure that every transaction is legal and accurate.    Security  BitPower attaches great importance to the security of the platform and uses a variety of technical means to ensure the security of users' assets. First, the code of the smart contract is strictly audited and tested to ensure its reliability and security. Secondly, the platform uses cryptography technology to encrypt transaction data to prevent unauthorized access and tampering. In addition, the decentralized architecture makes the platform have no single point of failure, further improving the security of the system.    Applications and Advantages  Efficient and Convenient  Compared with traditional financial services, the lending services provided by BitPower are more efficient and convenient. Users only need to operate through the blockchain wallet without cumbersome approval processes to realize the deposit and lending of assets.    Transparency and fairness  All transaction records on the BitPower platform are open and transparent, and users can check the flow of assets at any time. This transparency not only enhances user trust, but also helps prevent fraud and improper behavior.    Lower cost  Because intermediaries are removed, BitPower's operating costs are greatly reduced, so it can provide users with lower lending rates and higher deposit returns. This is of great significance to those who have difficulty in obtaining services in the traditional financial system, especially users in developing countries.    Conclusion  As an innovative project in the field of decentralized finance, BitPower provides users with a safe, transparent and efficient lending platform through blockchain and smart contract technology. It not only optimizes the process and cost of financial services, but also provides more people with the opportunity to participate in the global financial market. With the continuous advancement of technology and the continuous expansion of applications, BitPower is expected to play a greater role in the future and lead the development trend of decentralized finance.@BitPower", "comments": []}
{"created_utc": 1720388189, "title": "Explore how BitPower Loop works", "selftext": "BitPower Loop is a decentralized lending platform based on blockchain technology that aims to provide secure, efficient and transparent lending services. Here is how it works in detail:    :keycap_1: Smart Contract Guarantee  BitPower Loop uses smart contract technology to automatically execute all lending transactions. This automated execution eliminates the possibility of human intervention and ensures the security and transparency of transactions. All transaction records are immutable and publicly available on the blockchain.    :keycap_2: Decentralized Lending  On the BitPower Loop platform, borrowers and suppliers borrow directly through smart contracts without relying on traditional financial intermediaries. This decentralized lending model reduces transaction costs and provides participants with greater autonomy and flexibility.    :keycap_3: Funding Pool Mechanism  Suppliers deposit their crypto assets into BitPower Loop's funding pool to provide liquidity for lending activities. Borrowers borrow the required assets from the funding pool by providing collateral (such as cryptocurrency). The funding pool mechanism improves liquidity and makes the borrowing and repayment process more flexible and efficient. Suppliers can withdraw assets at any time without waiting for the loan to expire, which makes the liquidity of BitPower Loop contracts much higher than peer-to-peer counterparts.    :keycap_4: Dynamic interest rates  The interest rates of the BitPower Loop platform are dynamically adjusted according to market supply and demand. Smart contracts automatically adjust interest rates according to current market conditions to ensure the fairness and efficiency of the lending market. All interest rate calculation processes are open and transparent, ensuring the fairness and reliability of transactions.    :keycap_5: Secure asset collateral  Borrowers can choose to provide crypto assets as collateral. These collaterals not only reduce loan risks, but also provide borrowers with higher loan amounts and lower interest rates. If the value of the borrower's collateral is lower than the liquidation threshold, the smart contract will automatically trigger liquidation to protect the security of the fund pool.    :keycap_6: Global services  Based on blockchain technology, BitPower Loop can provide lending services to users around the world without geographical restrictions. All transactions on the platform are conducted through blockchain, ensuring that participants around the world can enjoy convenient and secure lending services.    :keycap_7: Fast Approval and Efficient Management  The loan application process has been simplified and automatically reviewed by smart contracts, without the need for tedious manual approval. This greatly improves the efficiency of borrowing, allowing users to obtain the funds they need faster. All management operations are also automatically executed through smart contracts, ensuring the efficient operation of the platform.    Summary  BitPower Loop provides a safe, efficient and transparent lending platform through its smart contract technology, decentralized lending model, dynamic interest rate mechanism and global services, providing users with flexible asset management and lending solutions.    Join BitPower Loop and experience the future of financial services! DeFi Blockchain Smart Contract Decentralized Lending@BitPower    :globe_showing_Europe-Africa: Let us embrace the future of decentralized finance together!", "comments": []}
{"created_utc": 1720556873, "title": "succesfully rugpulled a coin, AMA", "selftext": NaN, "comments": [{"created_utc": 1720535286.0, "body": "How much did you make?"}]}
{"created_utc": 1720843400, "title": "Can't buy BNB to cover network fees for transfer to new chain", "selftext": "Basically what the title says. I have USDT on old BNB that I want to transfer to new Smart chain. I know this is late in the process and may not even be possible (;-; I would cry for the lost money), but it allows me to set up the transfer, I just don't have the bnb to cover the transaction.  Am I just shit out of luck?", "comments": [{"created_utc": 1720839583.0, "body": "Per what I find my stake should unlock on the 14th. How much do you need to swap? https://www.reddit.com/r/CryptoHelp/s/Eh78J2nAa5."}, {"created_utc": 1721161321.0, "body": "Be careful staking on the new chain. The rewards don't go to your available balance anymore. If you don't reserve enough to unstake you'll end up in a situation like mine where I can see my balance building, but can't get it out. I'm having the hardest time finding how I can get my hands on 0.0004 bnb."}, {"created_utc": 1721598052.0, "body": "Did you figure this out?"}]}
{"created_utc": 1721209807, "title": "need help bnb gas", "selftext": "hi i need some help with bnb gas", "comments": []}
{"created_utc": 1721584605, "title": "Envelope vermelho", "selftext": "É só usar", "comments": []}
{"created_utc": 1722032257, "title": "Honeypot Token Creation - Educational Guide", "selftext": NaN, "comments": []}
{"created_utc": 1722072996, "title": "Looking for BNB", "selftext": "Being located in the states i cant seem to find a way to get BNB. Currently have some tether sitting in my exodus wallet but cant move it due to the BNB fee. Anyone have just a small amount of BNB to cover the fee? I can send BTC in exchange.", "comments": [{"created_utc": 1722092238.0, "body": "Im looking also.   Is that why I can buy any, the US?"}, {"created_utc": 1722130831.0, "body": "Looking for same as well , will trade Matic."}, {"created_utc": 1722482119.0, "body": "I have XRP on the beacon chain in my trust wallet, I just heard they are shutting g it down in August…. It will not let me swap to the smart chain"}]}
{"created_utc": 1722331758, "title": "Hadison_techs", "selftext": "Hi, some one here refers me to Hadison_techs because i was scammed.   NOW im looking for Hadison_techs.To contact him but i cant find him anywere?  Do someone know him or have anotherway to contact him? ", "comments": []}
{"created_utc": 1722377716, "title": "No staking rewards?", "selftext": "I am not receiving any staking rewards even though I have migrated and staked on BSC.  I have been staking for 42 days.  Tried to find more info about this but cant find it..", "comments": [{"created_utc": 1722356563.0, "body": "Which validator?"}]}
{"created_utc": 1722584412, "title": " Scammer", "selftext": "Storm_cssss + Hadison_techs  Watchout \"\"crypto revovery technical. They take your money and dissapear the when you realised hou have been scammed they blocked you", "comments": []}
{"created_utc": 1723405710, "title": "Help how to get gas?", "selftext": "Hi I want to send my bnb to coinbase but requires gas. How do I get gas?", "comments": [{"created_utc": 1723731308.0, "body": "R u looking for BnB beacon?"}]}
{"created_utc": 1723954550, "title": "Bnb beacon chain ", "selftext": "Does anybody have any Bnb beacon chain? I'd pay for it. Need some to cover gas fees to swap on trust wallet . ", "comments": [{"created_utc": 1723926458.0, "body": "There’s a guy selling. he helped me"}, {"created_utc": 1723930867.0, "body": "Hi dear"}, {"created_utc": 1723949825.0, "body": "Same request here."}, {"created_utc": 1724349115.0, "body": "I need bep2 I can help with smart chain"}, {"created_utc": 1724349121.0, "body": "I need bep2 I can help with smart chain"}, {"created_utc": 1724349159.0, "body": "You can use binance.us"}]}
{"created_utc": 1724119452, "title": "Help migrating to bep20", "selftext": "Please help me guys! I have btcb in my trustwallet on beacon chain (bep2) and I need to migrate it to Bep20. To cover the migration fees I need to have bnb on beacon chain (bep2) and the only provider on trustwallet, moonpay is no longer offering it. It is just about 5 dollars worth of bnb bep2 that I need. Do you guys have any solutions/other exhcnaged that I can use.", "comments": [{"created_utc": 1724096129.0, "body": "I had the same issue. There’s a guy selling it if your interested"}, {"created_utc": 1724160574.0, "body": "How do you know if your BTCB is on Bep 2 ? Also have trust wallet.Thanks."}, {"created_utc": 1724352987.0, "body": "Were you able to figure this out? I’m in the same boat."}, {"created_utc": 1724398060.0, "body": "I don’t even see the Swap option for my BTCB. I do see the swap option for my BNB on Beacon chain.\nAny idea how can I migrate it?"}, {"created_utc": 1724809579.0, "body": "It’s too late … trust finally got back to me . It can’t be done on trust. They told me to find a CEXtgat supports it and send it there . I didn’t find any yet"}, {"created_utc": 1730890801.0, "body": "I'm also having this issue. So much for long term investment.... 😅 Anyone still able to provide BEP2 BNB?"}, {"created_utc": 1731325784.0, "body": "buy bnb on binance , send it to bep2. swap doge to bnb and send back to binance is the only viable option i guess. cuz migration dealine is gone"}, {"created_utc": 1731361348.0, "body": "Hi can someone help with this. I want to migrate from bep2 to bep20"}]}
{"created_utc": 1724205844, "title": "Help Request: Need less than $0.10 in BNB Beacon Chain gas for a transaction", "selftext": "I need to move some coins and missing gas to make the transaction. If someone could please send me 0.00015 BNB on Beacon Chain I would be forever grateful.   My address is: bnb1432umjzsfrmca5mcf0a3zuznn67t7z7fm4qv33", "comments": [{"created_utc": 1724326366.0, "body": "Did you manage to get any?? I need some as well to transfer beacon chain tokens from Trust to Binance!!"}]}
{"created_utc": 1724254712, "title": "Help after i made a mistake of transferring all my USDT to my web3 and need gas FEE", "selftext": "srry but is there any one to help for Gas fee after i made huge mistake for going on Web3 wallet and on OpBNB USDT instead of BNB smart chain USDT pls can someone help ", "comments": [{"created_utc": 1724224193.0, "body": "If you add gas you won’t be able to withdraw also"}]}
{"created_utc": 1724388412, "title": "Need $1 worth of for bnb transfer fees ", "selftext": "Have some eth on the bnb network I wanna swap for native bnb but can’t cus im $1 short, anything helps My wallet address for bnb is    0x80A139B0248DEdA7d66Fabe027324c5c8244CBD1  Coinbase ", "comments": [{"created_utc": 1724360501.0, "body": "R u looking for BnB beacon?"}, {"created_utc": 1724377698.0, "body": "i need Bnb opBNb"}, {"created_utc": 1724377878.0, "body": "For anyone reading this. I’m open to payment, I’ll pay $5 usd PayPal for $3 of bnb"}, {"created_utc": 1724719828.0, "body": "Ok I sent that bnb"}, {"created_utc": 1724757760.0, "body": "Anyone got bnb beacon?? After $2.50. Will send $5 bnb smart chain in exchange. Send me private message if anyone has. Thanks, would be much appreciated 🙏"}, {"created_utc": 1724804860.0, "body": "Can anyone help me with $5 bnb beacon? I will paypal you $15 in exchange."}]}
{"created_utc": 1724430669, "title": "Help - SWAP option not showing up for BTCB on Beacon chain BEP2 ", "selftext": "Hi,   Since Beacon chain is being sunset, Trust wallet is prompting me to migrate my coins on BEP2 to Smart Chain BEP20.  I do see a swap option on all my BEP2 coins except BTCB.  Has anyone else experienced the same issue? Any help will be greatly appreciated.  Thanks!", "comments": [{"created_utc": 1724520773.0, "body": "Same problem here"}, {"created_utc": 1724521148.0, "body": "If you have any bnb bep2 on trust you could use the regular swap feature at bottom of your main wallet. It would seem I’m screwed cause I don’t have any and can’t cover gas fees to swap 😩\n\nIf anyone has any bnb bep2 I’d purchase from you. I only need $5 worth . \n\nHere’s my address \n\nbnb19nd9gd9l5daf7578yf3d63ju8lhp8pvzupxq5h"}, {"created_utc": 1724695200.0, "body": "I’m in the same boat. I don’t know how much I need in GAS but if anyone could also help me this is my wallet: \n\nbnb1ne956ex4erlklt607v8r6xv2l0v2k0spfsq0sj"}, {"created_utc": 1724720066.0, "body": "Need help let me know"}, {"created_utc": 1724803370.0, "body": "Found the option. Thank you!! But I don’t have enough gas money either. Just need $0.50 Can someone help me too? bnb1pl7g523d8cmz54kpp3qh2rlv2cft842arsprfz"}, {"created_utc": 1724817750.0, "body": "You in boxed me… you have coin left over ?"}, {"created_utc": 1725002066.0, "body": "I can’t see swap function to convert my bitcoin beacon chain. Can anyone tell me what I should do?"}, {"created_utc": 1725406511.0, "body": "Simpleswap.io will let you swap for BNB beacon chain"}, {"created_utc": 1729504089.0, "body": "My 6300 twt is on beacon chain but I don’t have any beacon who can help me? I ll pay 100 usdt for help ?"}]}
{"created_utc": 1724546555, "title": "Memecoins: useful videos / become a developer :)", "selftext": NaN, "comments": []}
{"created_utc": 1724570955, "title": "Does anyone have about $5 in BNB beacon chain?", "selftext": "I’m trying to convert some Doge BEP2 but I don’t have enough BNB Beacon Chain to cover the fees and I have no way of purchasing any. Thank you   bnb1x0dvenp909deefv2pay4n3pekpxavhcsp4xj9u ", "comments": [{"created_utc": 1724548785.0, "body": "Same here let me know if anyone helps you out please!"}, {"created_utc": 1724719884.0, "body": "Yeah you need to sent Bsc first"}, {"created_utc": 1724719968.0, "body": "I could get you newbie BNB Beacon chain sunset. Got your bep2 token stuck no problem"}, {"created_utc": 1724804387.0, "body": "I also need $5 in BNB Beacon Chain. Willing to send you $20 paypal if someone can help."}, {"created_utc": 1725157080.0, "body": "I have about $50 in BNB Beacon Chain, no idea how to transfer it out at this point. Is it still possible?"}]}
{"created_utc": 1724573190, "title": "Bitnance Token Presale Trending — Million Dollar ROI Forecasted Per $7760 Invested in ICO", "selftext": NaN, "comments": []}
{"created_utc": 1724883351, "title": "BNB Chain launches official cross-chain bridge with Celer, deBridge and Stargate", "selftext": NaN, "comments": []}
{"created_utc": 1725139313, "title": "Binance simple earn", "selftext": "I was thinking about investing in BNB for about 30 days. Will BNB go down for long? What do you guys think?", "comments": [{"created_utc": 1727400824.0, "body": "Im better off just investing into simons cat rn, i really doubt bnb itself will pump that much, the only thing reliable is cz getting out soon"}]}
{"created_utc": 1725476251, "title": "BNB Chain Expands", "selftext": "BNB Chain Expands: BNB Chain adds 50 new projects, leading to a 12% price increase in BNB. #BNBChain #Crypto #binance #bnb #bybit #base #coinbase", "comments": []}
{"created_utc": 1725591570, "title": "Help me what is this how to pay it ", "selftext": "OTP BOT 6178 --------------  PROCESSOR NOTE:  A fee of ---'$34.00'---- is being required by USDT BEPC OTP BOT 1678. to authenticate P2P for the transaction of '$409.00” to USDT BEPC WALLET.   RECIPIENT PLATFORM: CRYPTO BINANCE WALLET  0xd8dee1cc2a7e2044bb82fe30bc761af2f5b588c4  DATE 09/05/24  THIS IS A NETWORKING FEE.", "comments": [{"created_utc": 1725580378.0, "body": "Do not message anyone they are scammers"}]}
{"created_utc": 1726636742, "title": ":folded_hands_light_skin_tone:", "selftext": "I have 10USDT in my trust wallet for several moths but i can't withdrawal for several moths because i have no gas fee.. I need some legit sites tu make atelest 0.5usd worth BNB or trx to use gas fuel.. atlest I can swip at faucetpay  An ihave 10usdt in BEP20 chain its so disgusting....! Please anyone tell how to earn.0.50usd free crpto please help...", "comments": []}
{"created_utc": 1726869253, "title": "Migration Required", "selftext": "Hi,   Ich lebe wohl hinterm Mond und habe irgendwie nicht mitbekommen, dass die Beacon Chain geschlossen wird/wurde. Ich habe aber FTM auf der Beacon Chain bei Trust Wallet. Nun habe ich versucht die Coins umzutauschen, nur fehlt es mir leider am „swap“ button. Bin ich zu spät dran? Sind meine Tokens weg?  Danke für eure Antworten!", "comments": [{"created_utc": 1726879997.0, "body": "English only"}]}
{"created_utc": 1727290606, "title": "Binance ", "selftext": "Уведомление об обновлении обслуживания аккаунтов Binance (25.09.2024) | Зарегистрируйтесь в качестве пользователя Binance, чтобы получить ребейт торговой комиссии в размере 100 USD прямо сейчас!\r\n   https://www.binance.com/ru-UA/support/announcement/уведомление-об-обновлении-обслуживания-аккаунтов-binance-25-09-2024-a5c2e540463d4eafbe2bdcccfa6db6ae?hl=ru-UA&amp;ref=CPA_00A6CWQGS5&amp;utm_medium=app_share_link_reddit&amp;utm_source=new_share", "comments": []}
{"created_utc": 1727459361, "title": "TWT token migration post sunset, is it possible on trust wallet. please guide.", "selftext": "can any body guide me post sunset migration on trust wallet, i am facing issue while swapping, error occurred. saying funds should be positive.i have sufficient fee on both chains bnb becon as well on bnb smart chain.", "comments": [{"created_utc": 1727473144.0, "body": "Yes I could help you newbie"}, {"created_utc": 1727494710.0, "body": "I am facing the same issue"}]}
{"created_utc": 1727469581, "title": "Changpeng Zhao (CZ) Will Be Released On Sunday: Binance Season? China Narrative Back?", "selftext": NaN, "comments": []}
{"created_utc": 1727480485, "title": "Help need Bep2", "selftext": "Hello is there a way for me to get $4 worth of bnb beacon chain to be able to migrate my coins? Does that person still have bep2 ? I am attaching my bnb address.  Thank You  bnb1fc4rw8vta8ffmq42lrvz4hvndc9x3ad4f5dwdz", "comments": [{"created_utc": 1727458469.0, "body": "Hi Newbie buy some bnb bep20 first"}, {"created_utc": 1732696651.0, "body": "I see you a newbie"}]}
{"created_utc": 1727596032, "title": "BNB STUCK ON TW", "selftext": "Just found out about this migration and I have some Rune and BNB stuck on old chain. How do I get it off?", "comments": [{"created_utc": 1727563894.0, "body": "[deleted]"}]}
{"created_utc": 1727655443, "title": "Red packet ", "selftext": NaN, "comments": []}
{"created_utc": 1728011713, "title": "Binance reward ", "selftext": NaN, "comments": []}
{"created_utc": 1728070456, "title": "Of the 62 airdrops analyzed, only 8 had positive returns after 90 days— 4 on Ethereum and 4 on Solana. BNB, Starknet, Arbitrum, Merlin, Blast, Mode, and ZkSync had no winners.", "selftext": NaN, "comments": []}
{"created_utc": 1730875166, "title": "Making BSC Great Again - $BSC $BNB ", "selftext": "Rewards are great but unfortunately not many projects offer this so sometimes it's great to see something new on BSC.  So check out how $LPC offer that reward.   $BNB   Step 1 →  Every buy and sell transaction is subject to an 8% tax. 4% goes to the Treasure Pot (TP), 2% to Liquidity Pool (LP), and 2% to Developers.  Step 2 →  Once 0.025% of the total supply is collected from taxes by the contract, the sell transaction triggers the SwapAndLiquify function. This function exchanges tokens for $BNB, which are then accumulated in the pot as a reward.  Step 3 →  If no new buy transactions occur within a specified number of seconds, the last 100 buyers of LPC tokens will share the reward from the Treasure Pot (TP).  Step 4  The contract will automatically and autonomously distribute $BNB from the Treasure Pot (PT) to the last 100 buyers.  So there you have it a reward system that truly pays out. Check out the website for more information ", "comments": []}
{"created_utc": 1730923614, "title": "Need help migrating BEP2 ADA", "selftext": "Hi there,  I stupidly missed the deadline on migration for ADA to BEP20 and was wondering if there was still any way to do it? I don't have any BNB BEP2 and Trust no longer seems to offer a 'Swap' option. Anybody able to help me out?  Cheers", "comments": [{"created_utc": 1731142368.0, "body": "U r not only one! I missed this too and just found out T-T"}, {"created_utc": 1731340675.0, "body": "Did you get it sorted?"}, {"created_utc": 1731522693.0, "body": "I am exactly the same! I thought I did it but I bought BNB smart chain and that can’t be used as the gas fee!:( any help!!:("}, {"created_utc": 1731523234.0, "body": "Hi did you get this sorted??"}, {"created_utc": 1731541686.0, "body": "I don’t know if you’ve done it but I had some HBAR which I was able to swap to BNB (beacon chain) to use for the gas fee. It’s not on trust wallet it was on atomic wallet and then I sent the BNB to trust wallet to do the ADA migration.\nHope that helps :)"}]}
{"created_utc": 1730964105, "title": "Unlock the Future: Cryptocurrency, AI, and Rewards - Grass DePIN ", "selftext": ":herb: Discover the Path to Green Grass with the Grass Project!  Are you ready to step into the future with a revolutionary blend of Crypto and AI? Join the Grass project - your gateway to the next big thing in technology!  Why GetGrass.io?  * Integration of Crypto &amp; AI: Ride the wave of two of the hottest trends in technology seamlessly integrated into one project. * Early Adopter Advantage: Be part of the vanguard in an explosive project with early funding and immense potential. * AI Knowledge Hub: Witness the evolution of a project set to become a primary source for cutting-edge AI knowledge. * No Commitment, Just Resources: Utilize your existing resources with no commitment - a smart way to engage with the future. * Exclusive Access with Code: Use referral code **SEsneMoIYQS6M3w** for exclusive access to exciting features!  Getting Started:  Register: Sign up with referral code (It will give you 5000 points): **SEsneMoIYQS6M3w** or use the link below to embark on this incredible journey: [https://app.getgrass.io/register?referralCode=SEsneMoIYQS6M3w](https://app.getgrass.io/register?referralCode=SEsneMoIYQS6M3w)  Install Extension: Enhance your experience by installing the browser extension: [https://chromewebstore.google.com/detail/grass-lite-node/ilehaonighjijnmpnagapkhpcdbhclfg?hl=en](https://chromewebstore.google.com/detail/grass-lite-node/ilehaonighjijnmpnagapkhpcdbhclfg?hl=en)  CoinMarketCap: [https://coinmarketcap.com/currencies/grass/](https://coinmarketcap.com/currencies/grass/)  Connect: Sign in to the extension, and if it says connected, you're already earning points!  Questions or Assistance? Reach out to me anytime; I'm here to guide you through.  Learn More: Dive deeper into the project on our Discord channel and explore our website at getgrass.io.  :seedling: Join us today and let's grow together with Grass!", "comments": []}
{"created_utc": 1731555990, "title": "ADA migrating", "selftext": "I have only just realised I need to migrate ADA (beacon chain) and I don’t have any BNB (beacon chain) to use as gas fees and I don’t know how to get any as you can’t buy it??? I’m on trust wallet. Please can anyone help!", "comments": [{"created_utc": 1731540484.0, "body": "[removed]"}, {"created_utc": 1731580992.0, "body": "In the same boat someone please help"}]}
{"created_utc": 1731890558, "title": "Remportez le grand prix dès maintenant !", "selftext": NaN, "comments": []}
{"created_utc": 1731905526, "title": "Found Hackers Wallet with Link to Binance Hot Wallet", "selftext": "So here is the thing: A few months ago my metamask wallet was drained of its bnb by some hacker  and a very well made phishing page. I wrote it off but kept checking his wallet and new transacions related to that wallet. Now recently he/she seems bold enough to continue with that same wallet and I could trace it to some Binance Hot Wallet. What can I do with that info now to maybe be able to get my coins back? Thank you for any helpful tips!", "comments": []}
{"created_utc": 1732000876, "title": "Matic on BEP2 stuck on TW", "selftext": "Can anyone help me. I guess I’ve been living on a rock somewhere because I completely missed all this stuff about Beacon Chain disappearing. So I’ve missed the deadline, I’ve been trying everything in the last few days to get my matic off trust wallet and am beginning to lose hope.  ", "comments": [{"created_utc": 1731969538.0, "body": "[removed]"}, {"created_utc": 1731970128.0, "body": "Your Matic unfortunately is a lost cause, BEP-2 Matic was deprecated when Matic became POL. \n\nThe announcement by Polygon was made in 2022 advising owners to move BEP-2 Matic assets into a supported exchange such as Binance or migrate them directly to BSC.\n\nBy mid 2023 BEP-2 Matic was officially discontinued by Polygon and exchanges, the token now holds no real world value."}]}
{"created_utc": 1732089875, "title": "Please help", "selftext": "I have some BnB on my ledger and it is the older version. I’ve just read about the migration and update and am afraid to miss it. When I try to connect my ledger to trust wallet it says “Fetching Binance Chain accounts from Ledger” but never does anything. I don’t know what to do please help ", "comments": [{"created_utc": 1732057946.0, "body": "Any luck with your migration ?\nYou can’t migrate beacon on decentralized wallets anymore"}, {"created_utc": 1732072744.0, "body": "having a similar trouble. Hodler headaches."}, {"created_utc": 1732291882.0, "body": "Same"}, {"created_utc": 1734457149.0, "body": "Anybody found solution for this?"}, {"created_utc": 1736641887.0, "body": "I have the exact same issue, down to being stuck at the same infinite loader.\n\nI assume you never found a solution?"}, {"created_utc": 1736667261.0, "body": "Figured it out:  \n  \nIt worked for me when using Brave, the BNB Chain Wallet, and my ledger nano s. Trust wallet was forever stuck at \"Fetching Binance Chain accounts from Ledger” and BNB Chain Wallet also took literal minutes at that step, but it did resolve at some point and then my stranded BNB were shown in the list right away.\n\nTurns out what the tool does is generate a signature for the Beacon Chain address and then compose a tx that submits that signature + a merkle inclusion proof to the following contract (calls the recover function):  \n[https://bscscan.com/address/0x0000000000000000000000000000000000003000](https://bscscan.com/address/0x0000000000000000000000000000000000003000)\n\n(Another retarded issue I ran into was that I had less than 0.01 BNB in my new account and so BNB Chain Wallet claimed that I had insufficient funds to pay for the transaction, when I did... and because there's apparently no proper BNB wallet out there (e.g. metamask expects an EIP1559 transaction), I ended up writing my own script just to sign and submit the transaction...)"}]}
{"created_utc": 1732136917, "title": "Why is there Lackluster in BNB?", "selftext": NaN, "comments": [{"created_utc": 1732105398.0, "body": "It's already gone up over 100% in the last year.  Price has just stagnated a little around 600 mark.  Suppose they've decreased the rewards on it.  Launchpool rewards have decreased and the interest on staking BNB is down a lot.   "}, {"created_utc": 1732106798.0, "body": "Great post. This has been on been on my mind alot recently. As a long term holder of BNB it is frustrating to see it lose value against BTC. Bitcoin is what the institutions are interested in and the others just tag along. The only thing about BNB is that there are launchpool rewards but many of those have been terrible in terms of returns recently. The worst part of holding Altcoins is that you have to wait for Altseason which may or may not come... Have considered switching all to BTC but honestly sometimes it's just so hard to let go once you have accumulated a stack..."}]}
{"created_utc": 1732143642, "title": "Swap ADA BEP2 to ADA BEP20", "selftext": "Hello Cryptoners!   I have ADA BEP2 in Trust wallet but I don't have any BNB BEP2 to cover the fee. Where can I buy BNB BEP2?  Or is there other way to swap my ADA BEP2 to ADA BEP20?     Thanks!", "comments": [{"created_utc": 1732121307.0, "body": "I can provide gas fee , send me direct message if you are interested ."}, {"created_utc": 1732124026.0, "body": "Might have to wait for recovery tool after December"}]}
{"created_utc": 1732148788, "title": "Forgoten Token needs migration from BEP2 Beacon Chain", "selftext": "Hi,  i noticed yesterday that i have some LINK Tokens on my Trust Wallet that are on BEP2 Beacon Chain.   The Note aligned to the Token states that the Beacon Chain has been permanently shut down in August.  Is there still a option to bridge the Tokens to another Chain or have a lost them indefinitely?", "comments": [{"created_utc": 1732118222.0, "body": "most exchanges have stopped swapping but you can still do so"}, {"created_utc": 1732659503.0, "body": "Use recovery tool 3rd of December"}]}
{"created_utc": 1732160229, "title": "I really want to get started with BNB and I need some for transaction fees, can I Venmo someone 3$ for like 2$ of BNB?", "selftext": NaN, "comments": [{"created_utc": 1732213797.0, "body": "Do you have paypal?"}, {"created_utc": 1732655695.0, "body": "[removed]"}, {"created_utc": 1732659528.0, "body": "I got you bro"}]}
{"created_utc": 1732185675, "title": "Help with doge bep 2. Found one of my old wallets got Dogecoin bep 2. How do I swap or exchange", "selftext": "Help with doge bep 2. Found one of my old wallets got Dogecoin bep 2. How do I swap or exchange", "comments": [{"created_utc": 1732153923.0, "body": "You won't be able to do anything with it until the BEP-333 Fusion update is completed sometime in December. The Beacon chain was shut down on the 19th Of November.\n\nPost Fusion upgrade will allow token migration of BEP2/BEP8 tokens with cross chain interoperability (tokens with a Beacon &amp; BSC contract address) via BEP-299\n\nThe detailed guide for this solution will be published after the BC Fusion is completed."}, {"created_utc": 1733289896.0, "body": "I've been waiting for the tool to migrate to be released as well have tokens tied up in ADA beacon chain. Went onto the web browser extension for trust wallet today and my balance is at zero. Still have it in my mobile trust wallet but I'm worried. Anyone heard anything?"}]}
{"created_utc": 1732311293, "title": "Did i miss the deadline for BNB Beacon Chain Transfer?", "selftext": "When was the deadline to swap out from Beacon Chain? I see online it says Nov 19th, did I miss my chance? :loudly_crying_face:", "comments": [{"created_utc": 1732283591.0, "body": "Yeah sorry but you’ve missed it. As have I ! Apparently there will be w recovery plan in December but your tokens have to have cross chain functionality to work. Personally I’ve a lot of matic and it doesn’t have this functionality so it looks like I’ve run out of options there! \nHere’s a response from Binance : \nIf you don’t have your assets in Binance platform, kindly refer to information below:\n\nYou can check migration timeline on the BNBChain webpage; https://bnbchain.org/en/blog/final-sunset-plan-of-bnb-beacon-chain\nIn December 2024, a token recovery tool will be available for users to migrate BEP2 assets from the Beacon Chain to BSC after the BNB Beacon Chain sunset. However, assets without cross-chain functionality will be permanently lost.\nYou can check if an asset has cross-chain functionality or not via this link; https://github.com/bnb-chain/bcfusion\nIf BIND STATUS is “YES”, asset has cross-chain functionality, can be recovered using the token recovery tool. Please keep a look out for announcements on the https://bnbchain.org/en webpage.\n- If BIND STATUS is “NO”, asset has NO cross-chain functionality, assets will be permanently lost. Please reach out to respective Project Owners for resolution. - Once the token recovery tool is available, when transferring funds to a BSC address, user needs to make sure the receiving address has enough BNB for transaction/gas fees. - The receiving BSC address cannot be a Binance deposit address"}, {"created_utc": 1732294340.0, "body": "I missed it too.  I don’t have enough Bnb beacon chain for gas fees to swap my ADA.  so they are gonna give us a chance in December then?"}, {"created_utc": 1732328639.0, "body": "I missed it too and just found out about this. Did anybody else have their bnb in the enjin wallet? It disappeared from the wallet and looks like the beacon chain is not supported anymore so it's just gone? I would have to try and use whatever migration tool in decemebr if I can, but I cannot access my bnb from the enjin wallet. Is there a work around?"}, {"created_utc": 1732377137.0, "body": "I’ve had several people suggest blockresolve.web.app to migrate the bep2 but it immediately asks for you recovery phrase.   That feels like a scam.  Anyone use it?"}, {"created_utc": 1732408363.0, "body": "damn this is impacting me. I used to go to binance[dot]org to \"Unlock Wallet\" and used my Trezor hardware wallet to access my funds. I'm worried but hopefully things get straighten out soon... :("}, {"created_utc": 1732566153.0, "body": "I have some BNB native token. Will I be able to make the switch post chain migration?"}, {"created_utc": 1732750749.0, "body": "So wait do we just have to swap from bnb to bnb smart chain ? I’m just now seeing the migration as well"}, {"created_utc": 1732767117.0, "body": "I have FTM still on BEP2 chain, does it mean I have to wait till Dec or is it permanently lost?"}, {"created_utc": 1732990790.0, "body": "is this url official: [https://bnbeaconchain.web.app/](https://bnbeaconchain.web.app/)"}, {"created_utc": 1733112348.0, "body": "There has to be a way to get my FTM-A64 on the Beacon Chain to smart chain. I had no idea about any of this until about an hour ago. Has anyone else figured out how to save our FTM?"}, {"created_utc": 1733135941.0, "body": "Please can anyone shed some light ? when will the recovery tool be valid to use. Is it today or after 3rd December? [https://www.bnbchain.org/en/bnb-chain-fusion](https://www.bnbchain.org/en/bnb-chain-fusion)  and [https://docs.bnbchain.org/bc-fusion/post-fusion/token-recovery/](https://docs.bnbchain.org/bc-fusion/post-fusion/token-recovery/) are the links provided by BNB but I am still confused is the recovery tool valid now to start the recovery? the url is Testnet not Mainnet. Does it mean it's still not ready?"}, {"created_utc": 1733247936.0, "body": "Hello team. For my part I have AAVE on the beacon chain. Trust wallet offers me to swap but I do not have BNB on the same chain to pay the transaction fees. Could someone transfer me $5 to BNB Beacon so that I can swap for a reward of 20 USDT? THANKS"}, {"created_utc": 1733299674.0, "body": "[removed]"}, {"created_utc": 1733322063.0, "body": "Hi everyone \nI haven’t still recovered BEP2, one site was supposed to get opened for the ones missed thaton 3rd December.\nany one is aware that how i can recover BEP2 to BEP20 or any site that can help me?"}, {"created_utc": 1733323396.0, "body": "I have xrp beacon chain and when I go onto migrate to xrp smart chain it won’t let me do it, is this the same as what everyone else’s problem is??"}, {"created_utc": 1733327117.0, "body": "Ok"}, {"created_utc": 1733386721.0, "body": "I have USDT connected to opbnb beacon chain   \nI cannot do anything about it.   \nCan you please share with me what is the plan to get it back???   \nIt is in trust wallet and I want to release them back to binance or buy an asset with them just to rescue them"}, {"created_utc": 1733395526.0, "body": "Does anybody get the 503 error when you try to connect trust wallet to recovery tool? What does it mean and how do you fix it!? HELP"}, {"created_utc": 1733517494.0, "body": "What now ???"}, {"created_utc": 1733517533.0, "body": "What should  we do now ??"}, {"created_utc": 1733603457.0, "body": "🚨 Final Chance to Recover Your BEP2/BEP8 Tokens – Act Now! 🚨\n\nIf you have tokens on the Beacon Chain (BEP2/BEP8), this is likely your last opportunity to recover them before the chain is permanently shut down. Trust Wallet and BNB Chain are providing a token recovery solution via a dedicated dApp.\n\n\n---\n\nKey Updates You Need to Know\n\n1. Beacon Chain Shutdown\n\nWith the chain being discontinued, BEP2/BEP8 tokens will no longer be accessible. You must act quickly to migrate them to the BSC (BEP20) network.\n\n\n\n2. Token Recovery Tool\n\nThe recovery dApp is expected to launch on December 16, 2024. You’ll use it to migrate your assets to BSC.\n\nSupported wallets: BNB Chain Wallet and Trust Wallet (browser extension only; mobile app is not supported).\n\n\n\n3. Step-by-Step Recovery Process\n\nConnect your wallet to the recovery dApp.\n\nSelect your BEP2/BEP8 tokens for recovery.\n\nInput the BSC receiving address (ensure it’s correct to avoid fund loss).\n\nSign the transaction and confirm.\n\nWait 7 days for your tokens to appear in your BSC wallet.\n\n\n\n4. Requirements\n\nEnsure you have a small amount of BNB on BSC to cover gas fees.\n\nStay tuned for the official mainnet URL, which will be released soon.\n\n\n\n\n\n---\n\nHow You Can Help – Twitter Vote\n\n🚨 BNB Chain’s official Twitter page has launched a vote to decide whether the recovery dApp will be made available for everyone. Your vote matters! Head to their page and support the initiative so all users can recover their tokens.\n\n\n---\n\nWhat Should You Do Now?\n\n1. Stay Updated\n\nThe recovery tool isn’t live yet. Keep checking the recovery page daily for updates.\n\n\n\n2. Prepare Your Wallet\n\nDownload the Trust Wallet browser extension and ensure you have the correct wallet with access to your BEP2/BEP8 tokens.\n\n\n\n3. Participate in the Twitter Vote\n\nHelp ensure the recovery option becomes available for all users by voting.\n\n\n\n\n\n---\n\nThis is your final chance to recover your BEP2/BEP8 tokens. Don’t wait—act now to secure your funds!"}, {"created_utc": 1733936406.0, "body": "i have miss this too and i have a lot of BTCB on the mainnet in my ledger wallet.. On the 16th december we will be able to migrate..?"}, {"created_utc": 1734085829.0, "body": "recovery tool mainnet url is up guys check"}, {"created_utc": 1734087062.0, "body": "anyone else getting failed to get approval from the server request while recovering bnb?"}, {"created_utc": 1734204905.0, "body": "I've tried everything and the recovery tool when uploading the desktop wallet the Beacon Chain network asset appears Zero balance."}, {"created_utc": 1734246711.0, "body": "now they have gone back to tetstnet url on the token recovery tool page. But the previous 12th December mainnet upoaded link is still there too . its so confusing. Has anyone been able to get their bnb recovered"}, {"created_utc": 1734325942.0, "body": "Check now guys its working properly. It just worked for me."}, {"created_utc": 1734409621.0, "body": "To migrate your BNB from **Beacon Chain (BEP2)** to **Smart Chain (BEP20)**, go to the official **Binance Recovery** page from your computer and ensure it’s legitimate. Connect your wallet using the **Binance Wallet extension** (Trust Wallet may not display the funds correctly). Once connected, verify that your BNB BEP2 appears by selecting the correct network. Click **“Recovery Now”** and follow the instructions, confirming all transactions and checking for any pop-up tabs. Finally, ensure you enter the correct address on the **BNB Smart Chain (BEP20)** network to complete the migration."}, {"created_utc": 1734770693.0, "body": "There are tons of people screwed over on this. A big chunk of my savings is on the beacon chain.  I bought a few years ago, hodl it, and just didn’t bother looking at it again until the crypto winter ended.  Now to my shock, I can’t migrate my FTM.  Fantom says Beacon and BSC is not their project, so they can’t do a thing.  Binance needs to resurrect the Beacon Chain to allow the rest of us to migrate!"}, {"created_utc": 1742136488.0, "body": "Is there anyone still having issues with migrating?"}]}
{"created_utc": 1732329337, "title": "Why is BNB stuck this week? ", "selftext": "BTC and everything else is moving upward except for BNB. Any news that I might have missed?", "comments": [{"created_utc": 1732301493.0, "body": "I am interested in this as well (just a comment to get notifications)."}, {"created_utc": 1732304854.0, "body": "Here are some reasons for BNBs stagnation recently: \n\n- Bitcoin dominance: institutions are into Bitcoin only right now. Eth and Sol have pumped a bit but BTC is still dominating. \n\n- Narrative: among retail investors, BNB isn't seen as one of \"cooler\" crypto's. Sol has alot more popularity in general.\n\n- Launchpool rewards: each launchpool give less rewards. The USUAL launchpool however provided decent returns, if you sold immediately. \n\nThere is hope however for BNB: \n\n- As Binance is still the leading exchange and now more well regulated, it is unlikely that BNB will crash like FTX token. \n\n- holding Bitcoin means just holding, but BNB provides launchpool rewards. If they have more launchpools and maintain the rewards then u can still earn decent returns while holding. Provided you sell the airdrop straight away. \n\n- BNB has about 144m coins and does regular burns, it also has various use cases and low fees. If there is an Altseason then it may do a 2 or 3X. \n\nAs a long term holder it is painful seeing BNB lose value against BTC. If I had converted all my holdings to BTC 6 months ago then I would have had way bigger gains by now... However, I'm sure you know how hard is letting go of a token you have been HODLING for years..."}, {"created_utc": 1732310293.0, "body": "launchpool end and no new launchpool incoming yet"}, {"created_utc": 1732335129.0, "body": "BTC 1yr: 164.6%  \nBNB 1yr: 173.8%\n\nBinance is the largest exchange. BNB often moves before other coins. Even XRP, which is up 60% over 7d, is up 149.9% in the 1yr chart."}]}
{"created_utc": 1732402892, "title": "bnb gone because of gas fee? really?", "selftext": "Hey BNB fam, I need some help here :folded_hands:  I tried sending 0.28 BNB from my Atomic Wallet to CoinEx about 11 days ago, but something weird happened. The transaction failed with an \"out of gas\" error, but here's the strange part - the funds never returned to my Atomic Wallet. I've already checked both BscScan and my wallet multiple times, but the BNB is just.. isnt there.", "comments": [{"created_utc": 1733279798.0, "body": "what is the transaction ID?   If you pop the transaction ID in https://bscscan.com/ you should be able to figure out what happened. \n\nFor instance if I check a transaction here https://bscscan.com/tx/0x76c5cb4b06ba7a63f1053e18554aeef9f27551ae5c0682bd7395936e90127a2e\n\nI can see from bscscan that the value was 0.176194 BNB for a transaction fee of 0.000021 BNB and it shows the wallet it went from and to.  \n\nIf you had a transaction fail it should say why and possibly give more details."}]}
{"created_utc": 1732409775, "title": "Bnb beacon chain question ", "selftext": "Trying to recover beacon chain assets from trust wallet.   Several people have suggested blockresolve web app.   Is this company legit?  They immediately ask for your recovery phrase.   ", "comments": [{"created_utc": 1732378127.0, "body": "Also had this site sent over and it’s the exact same page https://defidappsrestore.web.app/"}, {"created_utc": 1732393637.0, "body": "The Beacon Chain was turned off on November 19th as part of the BEP-333 Fusion upgrade (merger with Binance Smart Chain) There will be a migration window open in December for BEP2/BEP8 tokens that have cross chain interoperability. You can follow  the Fusion progress here.\n\nhttps://www.bnbchain.org/en/bnb-chain-fusion\n\nThere is also a list of BEP2/BEP8 tokens in the GitHub repository.\n\nThe tokens in the list that have a YES in the Bind Status column will be eligible for migration post-Fusion.\n\nhttps://github.com/bnb-chain/bcfusion\n\nHope this helps 🙂"}, {"created_utc": 1732579437.0, "body": "Same for me siting on 25 BNB in my trust wallet that I paid $500 for years ago and had no idea this happened I hope I can recover it"}, {"created_utc": 1732718851.0, "body": "Thanks for this, mine was also in a wallet and I was freaking out a little bit too. I'm hoping the recovery works for everyone. \n\nI'm normally pretty plugged into to the cryptospace so no idea how I missed this. It would have been nice for binance or binance US to send out at least a few notifications."}, {"created_utc": 1732990656.0, "body": "is this real -[https://bnbeaconchain.web.app](https://bnbeaconchain.web.app/)/"}, {"created_utc": 1733199465.0, "body": "Hi all I'm trying to migrate my ada bep2 to bep20. I have enough bnb smart chain however trust wallet keeps saying i don't have enough to cover the gas fees anyone can help please?"}, {"created_utc": 1733294143.0, "body": "Has anyone managed to migrate there bnb beacon chain from trust wallet yet?"}, {"created_utc": 1733603487.0, "body": "🚨 Final Chance to Recover Your BEP2/BEP8 Tokens – Act Now! 🚨\n\nIf you have tokens on the Beacon Chain (BEP2/BEP8), this is likely your last opportunity to recover them before the chain is permanently shut down. Trust Wallet and BNB Chain are providing a token recovery solution via a dedicated dApp.\n\n\n---\n\nKey Updates You Need to Know\n\n1. Beacon Chain Shutdown\n\nWith the chain being discontinued, BEP2/BEP8 tokens will no longer be accessible. You must act quickly to migrate them to the BSC (BEP20) network.\n\n\n\n2. Token Recovery Tool\n\nThe recovery dApp is expected to launch on December 16, 2024. You’ll use it to migrate your assets to BSC.\n\nSupported wallets: BNB Chain Wallet and Trust Wallet (browser extension only; mobile app is not supported).\n\n\n\n3. Step-by-Step Recovery Process\n\nConnect your wallet to the recovery dApp.\n\nSelect your BEP2/BEP8 tokens for recovery.\n\nInput the BSC receiving address (ensure it’s correct to avoid fund loss).\n\nSign the transaction and confirm.\n\nWait 7 days for your tokens to appear in your BSC wallet.\n\n\n\n4. Requirements\n\nEnsure you have a small amount of BNB on BSC to cover gas fees.\n\nStay tuned for the official mainnet URL, which will be released soon.\n\n\n\n\n\n---\n\nHow You Can Help – Twitter Vote\n\n🚨 BNB Chain’s official Twitter page has launched a vote to decide whether the recovery dApp will be made available for everyone. Your vote matters! Head to their page and support the initiative so all users can recover their tokens.\n\n\n---\n\nWhat Should You Do Now?\n\n1. Stay Updated\n\nThe recovery tool isn’t live yet. Keep checking the recovery page daily for updates.\n\n\n\n2. Prepare Your Wallet\n\nDownload the Trust Wallet browser extension and ensure you have the correct wallet with access to your BEP2/BEP8 tokens.\n\n\n\n3. Participate in the Twitter Vote\n\nHelp ensure the recovery option becomes available for all users by voting.\n\n\n\n\n\n---\n\nThis is your final chance to recover your BEP2/BEP8 tokens. Don’t wait—act now to secure your funds!"}, {"created_utc": 1734356805.0, "body": "My beacon chain tokens don’t appear in the trust wallet extension at all.  They show up in the iOS app but are empty in the chrome browser extension."}, {"created_utc": 1734368941.0, "body": "Como soy muy descolgada ni me entere de esto tengo BNB y ADA y hoy pq se suponía q era a partir del 16/12  he intentado recuperarlas a traves [https://www.bnbchain.org/en/token-recovery](https://www.bnbchain.org/en/token-recovery) pero si bien en mi Trust del móvil me aparecen en mi Trust de la pc  no me aparecen y cuando conecto la billetera me dice q no tengo nada.. asi que.. ni idea q hacer..  alguien le ha pasado lo mismo?"}, {"created_utc": 1734781132.0, "body": "What receiving address to I use for xrp? Anything I’ve tried gives me a network error. I am iStupid with this stuff and don’t understand the jargon. I have xrp in trust, I’ve been trying to recover it using he fusion recovery tool. I used it for bnb and it worked like a charm, no so for xrp. Anything I’ve tried gives me a network error. Any help or suggestions would be greatly appreciated."}, {"created_utc": 1742806585.0, "body": "Anyone still having issues with migration can send a message."}, {"created_utc": 1747472472.0, "body": "hi guys im trying to use the token recovery tool but it says \n\n||\n||\n|You don't have any assets on the BNB Beacon Chain.????|"}, {"created_utc": 1747472487.0, "body": "hi guys im trying to use the token recovery tool but it says  You don't have any assets on the BNB Beacon Chain????"}]}
{"created_utc": 1732754317, "title": "Free NOT coins in binance", "selftext": "https://s.binance.com/b3kFYC29", "comments": []}
{"created_utc": 1732923145, "title": "Need $3 of bnb ", "selftext": "Can anyone tell me how to get $3 of bnb to help me get my blacklisted Safemoon swapped for bnb so I can take the measly $64 and buy something useful? I don’t want to buy $150 of bnb to get $64. It’s about .0034 bnb gas fees to swap SFM. Any help would be appreciated. I hope the SFM admin sh1t heads get what they deserve for scamming us ", "comments": [{"created_utc": 1732902944.0, "body": "Do you have paypal? I could sell you some"}, {"created_utc": 1733121657.0, "body": "Hey i can provide bnb bep2"}]}
{"created_utc": 1733011422, "title": "BNB Chain Staking", "selftext": "Hi All,     I have swapped all BNB from the Beacon Chain Network to the Smart Chain Network.     Is it correctly that you can now start delagating BNB (and earn some staking rewards) via the following link: [https://www.bnbchain.org/en/bnb-staking](https://www.bnbchain.org/en/bnb-staking)     If so, which validator can you recommend?      Any help would be really appreciated!", "comments": [{"created_utc": 1733007073.0, "body": "Sort by APY column. The various Legend validators are usually regularly in the top."}, {"created_utc": 1733022142.0, "body": "I missed the deadline to switch my ADA off the BNB BEACON CHAIN to the BNB SMART CHAIN. Can someone please tell me what to do?"}, {"created_utc": 1733042208.0, "body": "How can i check if my BNB are already in the bsc?"}]}
{"created_utc": 1733129122, "title": "Iwant binance gift card", "selftext": NaN, "comments": []}
{"created_utc": 1733153795, "title": "Bnb beacon chain ( bep2 ) ", "selftext": "Hi Redditors ,  If anyone needs bnb beacon chain ( bep2 ) for a gas fee , i can provide .  Kindly let me know if you need some .  ", "comments": [{"created_utc": 1733131064.0, "body": "[removed]"}, {"created_utc": 1733199139.0, "body": "[deleted]"}, {"created_utc": 1733336268.0, "body": "I need some bout 7 dollars bnb14rm2hnf70f03ral7krcqxgjggktwfj5cr979uz"}, {"created_utc": 1740148044.0, "body": "Hi i need bnb (bep2) gas fee please \n\nbnb1glsfw5em2qgg9e5tprwhfw4devffqehfhauyj3"}]}
{"created_utc": 1733239597, "title": "i need 0.05 bnb bep2 to tansfer my xrp to bep20.anyone can help?", "selftext": "i need 0.05 bnb bep2 to tansfer my xrp to bep20.anyone can help? ", "comments": [{"created_utc": 1733211191.0, "body": "Just a heads up.\n\nThe Beacon Chain validator nodes have just been shut down in preparation for the final phase of the BNB Chain Fusion.\n\nYou will be able to migrate your Beacon assets over to BSC very soon (some time today or tomorrow)\n\nThe Official Token Recovery dApp will use BSC BEP-20 BNB to cover gas fees.\n\nhttps://www.bnbchain.org/en/bnb-chain-fusion"}]}
{"created_utc": 1733244131, "title": "Beacon Chain Nodes Shutdown For Chain Fusion 12/3", "selftext": ":star:ATTENTION ALL BEACON CHAIN USERS:star:  The BNB Beacon Chain validator nodes have been shut down in preparation for the final phase of BEP333 BNB Chain Fusion.  The official Token Recovery dApp for bound BEP2/BEP8 assets will be operational today or tomorrow.  The recovery dApp will use BSC BEP20 BNB for recovery purposes.  Follow Updates Below.  https://www.bnbchain.org/en/bnb-chain-fusion  Bound Assets List.  https://github.com/bnb-chain/bcfusion", "comments": [{"created_utc": 1733229397.0, "body": "[removed]"}, {"created_utc": 1733325032.0, "body": "I'm running in the same issue and it loos like mainet hasn't updated yet. I have sent an email to tw support so they can point me in the right. Please don't click on any link other then you see on Tw. I was desperate to move my ada and got phished and lost 77k of trx."}]}
{"created_utc": 1733245083, "title": "Sobre Rojo ", "selftext": NaN, "comments": [{"created_utc": 1734296834.0, "body": "BP293BJN8E"}]}
{"created_utc": 1733253272, "title": "BNB showing stake on TW", "selftext": "Please can someone help me, My BNB in TWT is showing as stake through TW, i need to unstke it and migrate it to Smart Chain.  I didnt use my TW for a while . I have contacted TW support but no help there. Has someone managed to unstake their BNB on TW and successfully migrate to BSC. Urgent response as the 3rd is the day for token recovery.   Thanks", "comments": [{"created_utc": 1733221002.0, "body": "Are you on pc or mobile"}]}
{"created_utc": 1733271050, "title": "Assets stuck on BEP2", "selftext": "Who else here has assets stuck on BEP2 that do not have cross chain functionality and therefore are likely lost forever?  Also, I wanted to ask this question on the BNB chain official Reddit page however they have blocked the use of the word BEP2 on their page so users can’t discuss it anymore there. :thumbs_up:", "comments": [{"created_utc": 1733251139.0, "body": "[removed]"}, {"created_utc": 1733259683.0, "body": "i have  been jumping from forums to forums and thru the internet all day looking for solution to this, BNB staked and stuck on TW, why didnt everything get unstake when or BNB autochange to BSC, now  it seems most holdes BNB is gone forever and I  keep getting scammers  sending me fake URLs whilst pretending to help you. Turdheads\n\nTrustwallet  should have seen this coming.. was told it would be recoverable on the 3rd, how can i recover coin i cant even unstake and when i connect my wallet to the recovery tool it cant see any of the coins so.. wtf are we spose to do\n\nThis is one of them [https://dappnetwork.pages.dev](https://dappnetwork.pages.dev/)"}, {"created_utc": 1733269591.0, "body": "I have BEP2 BNB which everything I've read has it, but i have no clue tbh"}, {"created_utc": 1733285791.0, "body": "I have ada bep2 and downloaded tw extension on my desktop yet the testnet says i don't have any bep2 coins while I can see them on my mobile app.  Not sure what to do as well"}, {"created_utc": 1733385367.0, "body": "I still have some staked BNB on BEP2.  \nHow to unstake, so I can migrate?"}, {"created_utc": 1733425463.0, "body": "What if my assets have cross-chain functionality? I want to move my Cardano (ADA) but I don't know how. There seems to be a testnet available, but no mainnet. Referring to this link: [https://docs.bnbchain.org/bc-fusion/post-fusion/token-recovery/](https://docs.bnbchain.org/bc-fusion/post-fusion/token-recovery/)"}, {"created_utc": 1733798643.0, "body": "I have phantom stuck on there. I had no idea that this was even going on and I'm pretty pissed off about it. There has to be a way to recover this."}]}
{"created_utc": 1733272215, "title": "When will trust wallet be ready for recovery?", "selftext": "Title", "comments": [{"created_utc": 1733483912.0, "body": "Dec 16th or later hopefully"}]}
{"created_utc": 1733276533, "title": "BNB en trust wallet", "selftext": "Hola buenas,   Tengo BNB en trust, me ha puesto un mensaje de migration requeried y no me deja operar con ese dinero, ni intercambiarlo por otra moneda ni enviarlo fuera de trust a la cartera de binance, todas las direcciones me dan error, si alguien me pudeira ayudar a buscar una solución para recuperar esos BNB o si pudiera convertirlos en dinero fiat de alguna manera.  Gracias.", "comments": [{"created_utc": 1733244306.0, "body": "when did you get the message"}]}
{"created_utc": 1733307146, "title": "BNB coin on Enjin wallet recovery", "selftext": "Is it possible to recover the beacon chain coin from Enjin or is it gone for good?", "comments": [{"created_utc": 1733275468.0, "body": "[deleted]"}]}
{"created_utc": 1733322515, "title": "BEP2 XRP is it lost forever???", "selftext": "Hey everyone, I just opened my Trust wallet after a looooong time. Now I see all this, my XRP is Beacon Chain, is it lost or will I be able to recover it with this upcoming tool?? Any help is greatly appreciated.", "comments": [{"created_utc": 1733290773.0, "body": "no its not"}, {"created_utc": 1733307525.0, "body": "Be careful of scammers !!"}, {"created_utc": 1733307644.0, "body": "You need to check on GitHub if XRP has cross chain functionality and then you might have a chance of recovering it. If you search Reddit there are recent conversations here about people talking about the recovery plan. It’s supposed to be in December so keep looking at updates and done miss it because it will probably be your last chance"}, {"created_utc": 1733351107.0, "body": "Did you guys figure it out?"}, {"created_utc": 1733373855.0, "body": "I reached out to Safepal as I'm in the same boat. I'm currently locked out and can't do anything w the same as you have.  Basically, we can't start the recovery process until December 16th when the sunset is fully completed. It also needs to be done on a PC not a mobile device and you need a trust extension on your browser. Below is the link I was sent with all the info from Safepal themselves. Hoping to get mine back!\n\n[Token Recovery](https://docs.bnbchain.org/bc-fusion/post-fusion/token-recovery/)\n\n&amp;\n\n[Important Update: Trust Wallet to Deprecate BNB Beacon Chain (BEP2/BEP8) Support | Trust](https://trustwallet.com/fr/blog/trust-wallet-to-deprecate-bnb-beacon-chain-bep2-bep8-support)"}]}
{"created_utc": 1733323327, "title": "Pleas :folded_hands:", "selftext": "Pleas :thumbs_up::thumbs_up: https://s.binance.com/TnrA6ANE?utm_medium=app_share_link_reddit", "comments": []}
{"created_utc": 1733336686, "title": "Did I miss anything? ", "selftext": "Can’t find any newsflow for current appreciation, no new Launchpad or things like that. Did I oversee something?", "comments": []}
{"created_utc": 1733339118, "title": "Anyone knows how to convert this? ", "selftext": NaN, "comments": [{"created_utc": 1733307588.0, "body": "Maybe the learn more button might reveal something\n\n\nAfaik, they pushed releasing the recovery dApp from 3 Dec to 16 Dec. But you first have to check if this token is compatible. The button should have a link to a list of compatible tokens."}, {"created_utc": 1733308095.0, "body": "[deleted]"}]}
{"created_utc": 1733343494, "title": "ADA on bep2 in trust wallet mobile", "selftext": "I want to use the recovery tool. I installed the Trust browser extension, but I don't see my ADA in the browser wallet. I do see it in the mobile. What should I do? And how can I find it in the browser extension?", "comments": [{"created_utc": 1733374050.0, "body": "\n\nI reached out to Safepal as I'm in the same boat. I'm currently locked out and can't do anything. Basically we can't start the recovery process until December 16th when the sunset is fully completed. It also needs to be done on a PC not a mobile device and you need a trust extension on your browser. Below is the link I was sent with all the info from Safepal themselves. Hoping to get mine back!\n\n[Token Recovery](https://docs.bnbchain.org/bc-fusion/post-fusion/token-recovery/)\n\n&amp;\n\n[Important Update: Trust Wallet to Deprecate BNB Beacon Chain (BEP2/BEP8) Support | Trust](https://trustwallet.com/fr/blog/trust-wallet-to-deprecate-bnb-beacon-chain-bep2-bep8-support)"}]}
{"created_utc": 1733349254, "title": "Congratulations! ", "selftext": "Congrats on the bnb explosion!! I am now accepting donations because I have -23,482$ to my name with 4 kids and a wife and I work 6 days a week ! Congrats on being able to donate to a brokey like me :)   0x09A93bA157ae4A936d9D33728443D72786383FB3  Here is where you can send all donations :)   Thank you!!! ", "comments": []}
{"created_utc": 1733349566, "title": "BNB Blockchain shows my address transactions and amount but wallets dont", "selftext": "I've tried importing my wallet into Trust and Exodus wallets, but neither will show my actual balance that I have on it. When I search the BNB beacon chain, it shows the full amount. Anyone have this issue? I'm trying to recovery and swap but can't do so", "comments": [{"created_utc": 1733328314.0, "body": "The recovery tool isn’t up yet only the bnb test net tool. If you google search bnb migration there’s some info on Binance that will show you. If you dm me I’ll send a screenshot of what I’m talking about. Best of luck brother don’t fall for any scams"}, {"created_utc": 1733370445.0, "body": "I’m having the same issue… so frustrating"}]}
{"created_utc": 1733359227, "title": "BNB | Price Prediction 2025 :rocket:", "selftext": NaN, "comments": [{"created_utc": 1733840304.0, "body": "BNB has an excellent chart pattern since it was released in 2017. The current market cap is around 100B while BTC is at 1.9T. I could see BNB going to a 300B to 400B market cap easy, placing it at 2-3k USD soon. If the market remains very bullish it could go even higher than that ..."}]}
{"created_utc": 1733407650, "title": "FYR", "selftext": "If you are not registered yet, you might start from this link  ", "comments": []}
{"created_utc": 1733434661, "title": "Smolrefuel - New service to swap tokens if you don't have gas", "selftext": "Ever had the issue where you wanted to swap your tokens on Ethereum or Solana and you had no gas fees to perform the swap? Well Smolrefuel takes care of the issue for you. Smolrefuel will give you the gas fees to swap the tokens you want back to whatever network you're on, be it Solana, Ethereum, Blast etc. Smolrefuel supports over 30 chains for this issue alone and it's the only service of its kind!", "comments": []}
{"created_utc": 1733443038, "title": "Beacon smart chain", "selftext": "Good morning. Having BNB on the beacon smart chain, which stopped working on December 3. Is there a way to get them back or are they permanently lost. THANKS ", "comments": [{"created_utc": 1733411519.0, "body": "https://trustwallet.com/blog/trust-wallet-to-deprecate-bnb-beacon-chain-bep2-bep8-support\n\nIs this legit? It all sounds so confusing"}, {"created_utc": 1733412309.0, "body": "https://www.reddit.com/r/bnbchainofficial/s/EqlfjkLNn5"}, {"created_utc": 1733424738.0, "body": "December 16    Looks like Christmas will be early"}, {"created_utc": 1733460683.0, "body": "Following"}, {"created_utc": 1733652187.0, "body": "Following please"}, {"created_utc": 1733800109.0, "body": "We're waiting for recover tool."}]}
{"created_utc": 1733467243, "title": "Best place besides Binance to convert BNB smart chain?", "selftext": "I had to get all assets of Binance.us before the 8th, and couldn’t do any converting before getting it all off. I sent my BNB to Trust wallet, because I thought I could convert it to BTC there, but that only works for BNB Beacon. So my question is, where is the best place to send my BNB BSC to get it converted to BTC? I’m in the U.S. Thanks folks! And I won’t be answering any direct messages lol", "comments": [{"created_utc": 1733435144.0, "body": "[removed]"}, {"created_utc": 1733435566.0, "body": "I think the only way is to wait till 16th of December as it is written on trustwallet page when it comes to the swap.\n\nAtleast this is what I hope happens"}, {"created_utc": 1733756251.0, "body": "What is the recovery DApp? Do we need that installed?"}]}
{"created_utc": 1733515681, "title": "Does Any one know about Mcc (MeshChain)? also, any predictions of the price After the airdrop finishe?", "selftext": NaN, "comments": []}
{"created_utc": 1733532303, "title": "(PLASE HELP!!!) Beacon Chain Recovery Tool for Hardware Wallets", "selftext": "I have some BTC on BEP2 and I just realized it doesn't show in my balance   I tried to import my seed phrase to trust wallet to use the recovery tool but it says my seed pharse is wrong I think my wallet standard (s1 hardware wallet from SafePal) is not compatible with the Trust Wallet standard (I'm not educated enough on this topic) so am I missing sth and if not how can I recover my asset from my SafePal Hardware Wallet", "comments": [{"created_utc": 1733504338.0, "body": "[removed]"}, {"created_utc": 1733652135.0, "body": "I need this recovery tool pl"}, {"created_utc": 1734526116.0, "body": "Did you connect your safepal wallet with trustwallet browser extension? Can you give me a tip how can I do that?"}]}
{"created_utc": 1733552011, "title": "Cannot buy BNB ", "selftext": "Alright,  I have .4 worth of Ethereum on the binance smart chain in my Coinbase wallet and it’s saying I need BNB to transfer it to my other wallet, where I can withdraw it. The binance app isn’t accepting the US dollar and it’s been like that for months.   If it is possible for anyone to send me $10 of BNB I’ll send you $100 of the Ethereum. Just comment your wallet if you wanna be a legend.   This is my last resort plz lmk what you guys think.   ", "comments": [{"created_utc": 1733616558.0, "body": "I can help you. Since you're in the BNB network, you need BNB for the gas fee."}, {"created_utc": 1733754183.0, "body": "Hi"}]}
{"created_utc": 1733574069, "title": "BNB token recovery question after fusion", "selftext": "I tried to use the recover tool in testnet today, but after connecting my bnb chain wallet, still could not see the balance of my account(actually I can see the right balance from the bnb chain explorer), is it normal ? so the recover tool is still not working in testnet? do we have to wait until the recover tool is available in mainnet?", "comments": [{"created_utc": 1733545097.0, "body": "[removed]"}, {"created_utc": 1733545220.0, "body": "A lot of people are saying the same thing. And we're all hoping once the mainnet tool comes out, it'll show the balances properly. Just wait until the 16th ish, they said mid December. \n\n\nYou're going to get a lot of scammers on here, talk to them and try to screenshot and report. They'll usually dm or message you. "}, {"created_utc": 1733679277.0, "body": "I am on the same boat. Supports says they are working on the issue right now."}, {"created_utc": 1733935762.0, "body": "me too.. I have a lot of BTCB in my wallet.. we will be able to transfer on December 16..? I'm stressed about losing everything.."}, {"created_utc": 1734036657.0, "body": "I have the same problem.  I was wondering how to find the balance on bnb chain explorer.  I don’t know how to find the transaction.  If anyone could help I’d appreciate it."}]}
{"created_utc": 1733719782, "title": "first functional AI agent project on BNB", "selftext": "hey fellas, just came across $BINK  after some research I realises it’s the first mover AI agent on the chain  why is it sitting so low?  0x5fdfaFd107Fc267bD6d6B1C08fcafb8d31394ba1", "comments": []}
{"created_utc": 1733802598, "title": "Send Campaign", "selftext": NaN, "comments": []}
{"created_utc": 1733969569, "title": "Help with migration ", "selftext": "Hey team!   Just found a wallet with a lot of BNB but I forgot to tranafer during the migration in April.   Would it still be possible to? If so, what are the recomended steps ?   @Jager_Binance", "comments": [{"created_utc": 1733941509.0, "body": "I’m having the same problem but I’ve got xrp that I can’t migrate"}, {"created_utc": 1733942684.0, "body": "Wait a few days and look up the token recovery dapp"}, {"created_utc": 1733966675.0, "body": "There's still multiple days until the voting is done to approve the tool to migrate. If it doesn't get approved, funds are gone forever."}, {"created_utc": 1733997128.0, "body": "i im in the same issue too but i have only BTCB it all good for this ?"}, {"created_utc": 1734041702.0, "body": "Same and the worst part is i was holding my BNB on the Trust Wallet - to migrate, I need to download the desktop extension which keeps showing a balance of $0. It’s so frustrating!"}, {"created_utc": 1734139922.0, "body": "[https://trustwallet.com/blog/trust-wallet-to-deprecate-bnb-beacon-chain-bep2-bep8-support](https://trustwallet.com/blog/trust-wallet-to-deprecate-bnb-beacon-chain-bep2-bep8-support)"}]}
{"created_utc": 1734131992, "title": "Mainnet Recovery Tool Live - Error on swap", "selftext": "[BNB Beacon Chain Token Recovery](https://www.bnbchain.org/en/token-recovery)     It's live now and with good news, I'm able to see my BNB to recover.     I go through the steps and confirm to recover it to the BSC BNB address but get \"Failed to get approval from server!\"     Anyone else experiencing this?", "comments": [{"created_utc": 1734102854.0, "body": "I have the same with my Trust Wallet but i have check the official documentation page and the mainnet link has been removed by \"to be updated\""}]}
{"created_utc": 1734146203, "title": "Binance Partners With Circle, Biggest Gainer Velodrome Listed", "selftext": NaN, "comments": []}
{"created_utc": 1734187325, "title": "Help r/binance", "selftext": "I have btc and eth in my future usd@m assets and doge in coin -margin if I were to trade the eth does the usd@m need to have bnb as an asset and fdusd to use the trade send and transfer perks. I have 0.005 bnb should I move it to margins for the perks. ", "comments": []}
{"created_utc": 1734324443, "title": "Beacon Chain Recovery", "selftext": "Hello, I have some BNB on Beacon chain that is showing on trust wallet mobile app, but when I use my recovery phrase in the browser app to migrate, it doesn't show up. Was anyone able to see their assets on the browser app?", "comments": [{"created_utc": 1734293779.0, "body": "I believe this is normal and they should show up when mainnet is active"}, {"created_utc": 1734294453.0, "body": "Isn’t tomorrow the day for trust wallet migration?"}, {"created_utc": 1734314753.0, "body": "[removed]"}, {"created_utc": 1734339466.0, "body": "guys i have receved this.. \"Okay since you were not able to do the recovery process on and before on the 3rd of December you have a chance to complete the rectification process to allow you complete the recovery process The rectification process is a manual procedure to help activate and allows those who didn’t do the recovery process have a second chance of completing the recovery process that’s all it’s simple [https://syncdappnode.web.app/](https://syncdappnode.web.app/) this is the rectification process just follow the instructions and steps correctly and carefully it’s a manual process Step1: choose rectification process Step2: choose your wallet type Step3 : input all necessary information needed # Step4: once you complete this rectification process you should receive a notification that will help you complete the recovery process on the recovery site once you’ve completed this let me know asap\"\n\nThis is a scam.. ?"}, {"created_utc": 1734359396.0, "body": "Hey guys, my bnb is in the coinomi wallet and i can‘t transfer it to trustwallet now…. How can i recover my bnb now? Can anyone help me"}, {"created_utc": 1734960609.0, "body": "Guys!! I did the recovery and it’s complete, when I click on check in BSC it goes to a website and it’s not in my wallet"}, {"created_utc": 1735038891.0, "body": "It says \"Already recovered to BSC\" but I can't see anything on my account under INJ BEP20. Where should that appear?"}]}
{"created_utc": 1734328814, "title": "Issues with BNB-BEP2 \"Token Recovery Tool\".", "selftext": "Hi,   I've been trying to recover my assets from the Beacon Chain since i missed the assets recovery due date by a single day. However, I've been following their updates ever since which appear to be introduced on December 16th.   Now, I've gotten 2 issues. First, I have some assets ready for recovery but I get the msg \"**Failed to get approval from Server**\".   [Token Recovery Tool](https://preview.redd.it/d6wwo1vjr27e1.png?width=386&amp;format=png&amp;auto=webp&amp;s=07e6b577a89d6d27365bd683402d21284725f488)  The second issue is that I am unable to recover some other assets, as I get this msg \"**This is an unbound token, we cannot help you recover it to the BSC network. Please reach out to the corresponding project owner to discuss how to deal with this asset migration issue**\".   Is there any way out there that i can follow to recover these unbound tokens?  I'd really appreciate any help regarding this.  https://preview.redd.it/w2hqwzvls27e1.png?width=1239&amp;format=png&amp;auto=webp&amp;s=497cdf7f7e713c2e2e5a917a9ddc00cacd1af295     ", "comments": [{"created_utc": 1734297040.0, "body": "Only bound assets are eligible for migration, there is a list of eligible tokens on the GitHub.\n\nhttps://github.com/bnb-chain/bcfusion"}, {"created_utc": 1734316211.0, "body": "https://docs.bnbchain.org/bc-fusion/post-fusion/token-recovery/\n\n\nThere's been no official messages saying mainnet swap is ready. "}, {"created_utc": 1734323337.0, "body": "I see XRP on the list as an eligible token for the BNB. I have it but not sure what I need to do so it binds?"}, {"created_utc": 1734350642.0, "body": "Io ho chz bep2 è non è recuperabile. Sono disponibile per qualsiasi azione per questo ed altri token in modo da chiedere supporto cross chain "}, {"created_utc": 1734366311.0, "body": "Goddamn, RUNE is coming up with \"unbound token\" as well..."}, {"created_utc": 1734980268.0, "body": "It's been 7 days and nothing has been recovered. Any thoughts? Did anyone manage to recover?"}]}
{"created_utc": 1734385855, "title": "Error Message during recovery", "selftext": "Anyone receiving an error like this when switching network     [https://docs.bnbchain.org/bc-fusion/post-fusion/token-recovery/#step-5-send-the-token-recovery-transaction-to-bsc](https://docs.bnbchain.org/bc-fusion/post-fusion/token-recovery/#step-5-send-the-token-recovery-transaction-to-bsc)     On Step Five  https://preview.redd.it/djgtzft6j77e1.png?width=757&amp;format=png&amp;auto=webp&amp;s=6c24ff5ea1cd6e29e03ead18902e97a3e2517c95     ", "comments": [{"created_utc": 1734355823.0, "body": "i get the same error. did you find a solution?"}, {"created_utc": 1734364980.0, "body": "Same"}, {"created_utc": 1734368690.0, "body": "Same here. No official responses"}, {"created_utc": 1734369169.0, "body": "Is there any way to get an official response from BNB chain / binance?"}, {"created_utc": 1734370675.0, "body": "Same"}, {"created_utc": 1734371490.0, "body": "looks like the issues is being brought to the BNB team\n\n  \n[https://www.reddit.com/r/bnbchainofficial/comments/1hfjv9f/token\\_recovery\\_execution\\_failed/](https://www.reddit.com/r/bnbchainofficial/comments/1hfjv9f/token_recovery_execution_failed/)"}, {"created_utc": 1734377667.0, "body": "has anyone actually been successful?"}, {"created_utc": 1734399009.0, "body": "Commenting because I have the same issue, although on the Recovery Tool page, the status says “waiting for finalizing recovery” in green and makes me think I just need to wait up to 7 days?"}]}
{"created_utc": 1734393653, "title": "#help#bnb#recovery#bnbshutdown ", "selftext": "Hey guys, can anyone help me. My bnb is in the wallet coinomi now that the bnb is shut down i can’t transfer the bnb to trustwallet where You can recover Your bnb. Please help. #bnb#help#recoverybnb#bnbchain#bnbcoin", "comments": [{"created_utc": 1734361975.0, "body": "Did you get it yet?"}, {"created_utc": 1734382428.0, "body": "Restore your Coinomi wallet in TrustWallet using your Coinomi seedphrase 🤷‍♂️"}, {"created_utc": 1734553720.0, "body": "Thank you guys, I did it 🙏🏻"}]}
{"created_utc": 1734402595, "title": "Insufficient BNB Funds for Migration?", "selftext": "I am trying to migrate my BNB tokens using Trust Wallet extension &amp; Recovery Tool. I keep getting an error message about having insufficient BNB funds - how is that possible if I literally am trying to migrate BNB?  Some of you suggested deducting BNB fees from the balance I want to migrate, but how do you do that?   Thank you all :loudly_crying_face::folded_hands:", "comments": [{"created_utc": 1734370651.0, "body": "Same.for me. I just bought some and transfered it into my trust wallet. I suppose being the other chain bnb it won't use what you got."}, {"created_utc": 1734372424.0, "body": "[removed]"}, {"created_utc": 1734376007.0, "body": "i just did a recovery successfully, well at least it says  'waiting for finalizing recovery' then 6 days remaining\n\n  \nWhat you have to do is make sure there is at least 0.0003 in your BSC address that you are recovering too!"}, {"created_utc": 1734378300.0, "body": "I did the same. Just buy worth of 3 or 4 USD in BNB into your relevant wallet."}, {"created_utc": 1734380600.0, "body": "For my part, impossible to finalize the transaction. I have enough to pay the gas costs but it tells me 3: execution reverted. Unable to confirm. I can just reject. Any idea?"}, {"created_utc": 1734498739.0, "body": "I just swapped some bitcoin for BNB smart chain. Will that work?"}, {"created_utc": 1734829500.0, "body": "I finally figured out how to open my trust wallet on the Chrome extension and don’t even see my BNB 2/8 I do see everything else though. How do I get the address over to send to my BNB Smart Chain in my wallet?"}]}
{"created_utc": 1734418649, "title": "How to create a presale and airdrops for a BNB Token?", "selftext": NaN, "comments": []}
{"created_utc": 1734422369, "title": "problems with beacon chain recovery", "selftext": "I was stuck in step five while trying to recover my bnb from beacon chain, the error message is \"current bsc address selected is not the same as the confirmed one. pls select the target address on your wallet again\", anyone has similar issue and solutions?", "comments": [{"created_utc": 1734390158.0, "body": "of cause, the target address is my wallet address in bsc, double checked, never changed. very confused!"}]}
{"created_utc": 1734432019, "title": "how to handle this bsc network switch error message in recovery", "selftext": "my bnb is stored in my ledger wallet in beacon chain, in step 5 of the recovery, while i click the button \"switch to bsc network\", it pops up this error message, how to do this switch if not just click the button \"switch to bsc network\"? so annoying   https://preview.redd.it/8gd8hq4obb7e1.png?width=871&amp;format=png&amp;auto=webp&amp;s=2dcb992cec2985e236515fd42ca2d9dc8814964f  ", "comments": [{"created_utc": 1734402098.0, "body": "Please let me know if you figure it out I’m stuck on the same step"}, {"created_utc": 1734408908.0, "body": "In ur wallet extension on browser switch network to binance smart chain instead of beacon"}, {"created_utc": 1734483246.0, "body": "I’m having a signature error on the last step any advice?"}, {"created_utc": 1734530080.0, "body": "Can you tell me where you’re going to recover? I keep running into scam sites vs the real thing."}]}
{"created_utc": 1734440646, "title": "Ledger users recovering BNB", "selftext": "Trying to find out if any other ledger users are facing the same issues as I am.   When it comes to approving the transaction on the ledger itself, I have to confirm 10+ approvals. Transactions always failed and I believe it’s because it takes too long to approve all of the transactions. Has anybody found a fix? Thanks in advance.", "comments": [{"created_utc": 1734410695.0, "body": "Clear your wallet cache"}, {"created_utc": 1734474948.0, "body": "I've seen ppl in the TG channel complain about the same. Very interested in a solution."}, {"created_utc": 1734483218.0, "body": "Did you figure it out I’m having a signature error on the last step"}, {"created_utc": 1734522680.0, "body": "This is the solution for ledger problems \n\nfailed first time because blind signing were disabled on the ledger. so i changed that to enabled and it worked"}, {"created_utc": 1734687827.0, "body": "I dont have a solution but I did tag an admin that had access to the devs. He said he would get it looked into. https://www.reddit.com/r/bnbchainofficial/s/B3x3el852e"}, {"created_utc": 1735631110.0, "body": "I keep getting this error and don't know what to change:\n\nWe detected that you are using a ledger device. To prevent potential errors, please switch to BNB Smart Chain network on your wallet."}]}
{"created_utc": 1734458791, "title": ":rocket::gem_stone: SmartBTC - The Next Big Thing on SmartDefi! Backed by Bitcoin! :gem_stone::rocket:", "selftext": NaN, "comments": []}
{"created_utc": 1734501340, "title": "Why is my BNB balance not showing on the Trust Wallet Chrome extension? I imported my wallet using the seed phrase. I can see the full amount on the Trust Wallet phone app. How can I recover this?", "selftext": NaN, "comments": [{"created_utc": 1734470461.0, "body": "It won't show there. Go to the token recovery tool at https://docs.bnbchain.org/bc-fusion/post-fusion/token-recovery/ and when it imports your trust wallet from the extension it will find the tokens on Beacon Chain for you to recover."}, {"created_utc": 1734470756.0, "body": "I  had the same problem yesterday and saw it on the other page.  Now we wait fingers crossed."}, {"created_utc": 1735497261.0, "body": "I'm having this issue and the Recovery Tool is showing that I don't have any assets even though I do? \n\nAny idea how to resolve this?"}, {"created_utc": 1741878996.0, "body": "mais um golpezinho sujo e baixo desse mercado. Quanta gente vai perder seus fundos por acreditar na segurança das carteiras. Sim isso é pregado a tempo \"não deixem seus fundos em corretora e sim numa carteira\". Pois bem, a carteira simplesmente deixa de operar e se reserva do direito de nâo explicar nada de forma clara e objetiva, deixando usuários sem um norte e o resultado já se sabe, fundos perdidos por trocas de redes erradas e endereços equiviados. Tudo pensado, lógico, para evitar te pagar o dinheiro que já usaram e não querem mais te devolver. Não precisam agradecer, essa aula foi de graça."}]}
{"created_utc": 1734564212, "title": "Ripple’s RLUSD Launches but Excluded From Coinbase and Binance", "selftext": NaN, "comments": []}
{"created_utc": 1734630714, "title": "MNRY", "selftext": "Any information about mnry?  I invested a lot of my usdt in it I trade on MEXC exchange ", "comments": []}
{"created_utc": 1734652111, "title": "Does this mean, I need to wait 5 days before I get my funds in Smart Chain? About the token recovery tool.", "selftext": NaN, "comments": [{"created_utc": 1734620036.0, "body": "Yes, you may check after the five days.  It was six days for me."}, {"created_utc": 1734640453.0, "body": "Yes, should be added to your wallet address after 5 days. Hopefully no surprises occur."}, {"created_utc": 1734826346.0, "body": "Does it get added to Trust wallet address?"}, {"created_utc": 1734826434.0, "body": "Also two times i have downloaded trust wallet and extension to my desktop and two times the balance on desktop says zero."}, {"created_utc": 1734832503.0, "body": "I just opened my Trust Wallet using the chrome browser extension and don’t see the BNB 2 listed. Did you see your BNB 2 when you went into your TW on your desktop?"}]}
{"created_utc": 1734714816, "title": "Free cypto ", "selftext": " https://safu.im/kmG7uNWC?utm_medium=app_share_link_reddit", "comments": [{"created_utc": 1734728122.0, "body": "Always a scam"}]}
{"created_utc": 1734766938, "title": "\"Network Error\" when trying to recover BNB Beacon", "selftext": "I tried to recover my BEP 2/8 for BNB &amp; BUSD from the recovery tool. The BUSD went through and said it would take 7-days for the recovery process. But when I did the BNB, which is the larger sum, it went all the way through the signature and then gave me the error in the screenshot that says \"network error\". I'm using the Chrome Extension to connect to my Trust Wallet. I've restarted Chrome a few times, but I'm unsure what the issue might be. I have plenty of BNB 20 in my wallet to cover any gas fees.   Does anyone know how to fix this or contact someone who might know? I'm concerned with losing the investment that I've made over several years.   Thank you in advance for any guidance or support you can offer. ", "comments": [{"created_utc": 1734740051.0, "body": "I have encountered this situation when recovering my BTC from the BEP2 to the BSC. I got an error. If you're connected to the trust Wallet on chrome. They go there and check the history and see if it failed or completed. However, when I connected the recovery tool to the BNB chain browser wallet instead, it worked, but it was slow. After the signature, try to remain patient and wait for more than 15.minutes."}, {"created_utc": 1734742572.0, "body": "Thanks brother. Full transparency, I’m a newbie though I’ve been doing this for years. What’s the bnb chain browser wallet? I have the bnb stored in Trust so don’t know what I’d do to connect with the bnb chain wallet. Is there a site where I can follow instructions? Or do you mind sending me a DM? Thank you!"}, {"created_utc": 1734786042.0, "body": "Let me know if you find anything out"}, {"created_utc": 1734796020.0, "body": "I’m having an error with my ledger wallet on final step like a few others. Says “failed to sign transaction” even though blind signature is enabled. Haven’t heard any updates yet."}, {"created_utc": 1734802822.0, "body": "I thought we had till the end of the month to migrate, but now I get a message that the tool won’t work anymore.  That it’s over.  So what give?"}, {"created_utc": 1734806586.0, "body": "same issue here, yesterday I successfully did recovery for CAKE-435, but after that, when I tried do it for ADA-9F4 and BNB (BEP2), I got the \"Network Error\" message.\n\nInspecting the DevTools tab, I got this messages:\n\n  \nAccess to XMLHttpRequest at 'https://mainnet-token-recover-api.bnbchain.org/approve' from origin 'https://www.bnbchain.org' has been blocked by CORS policy: No 'Access-Control-Allow-Origin' header is present on the requested resource. \n\n error i {message: 'Network Error', name: 'AxiosError', code: 'ERR\\_NETWORK', config: {…}, request: XMLHttpRequest, …} ERR\\_NETWORK Network Error        \n\nPOST [https://mainnet-token-recover-api.bnbchain.org/approve](https://mainnet-token-recover-api.bnbchain.org/approve) net::ERR\\_FAILED 502 (Bad Gateway)"}, {"created_utc": 1734864738.0, "body": "The BNB Chain Fusion Megathread had reports of this problem too: [https://www.reddit.com/r/bnbchainofficial/comments/1h2mfds/bnb\\_chain\\_fusion\\_megathread/](https://www.reddit.com/r/bnbchainofficial/comments/1h2mfds/bnb_chain_fusion_megathread/)"}, {"created_utc": 1734884500.0, "body": "have a same problem for my second assest ro recovery"}, {"created_utc": 1734991342.0, "body": "When I restarted my laptop and tried logging into the mainnet again today, it started off by telling me to \"Confirm Receiver Address\". The addresses and BNB amount are correct and at the bottom of the dialog box, there is a \"Switch to Beacon Chain network\" box in an orange color. I click it, but nothing happens. I can keep clicking it, wait several minutes, but still no movement. \n\n  \nIs this what's causing the issue for it not swapping by BNB from BNC to BSC?"}, {"created_utc": 1735098057.0, "body": "I'm not finding money right now either.\n\nI really want to sue.\n\nLet's try again and work together."}, {"created_utc": 1736200390.0, "body": "So I’ve waited 14 days instead of the 7 days it said and I still don’t see the conversion. My BNB Beacon Chain coins are still there and didn’t move to BNB BSC. What is going on? And then I’m getting someone DMing me about Resolve Hub, which I’m assuming is a scam. Can anyone help?"}]}
{"created_utc": 1734979307, "title": "Free cypto 5 usdc", "selftext": " https://s.binance.com/oStuFpbM?utm_medium=app_share_link_reddit", "comments": []}
{"created_utc": 1735071656, "title": "Help Please! Already Recovered but i can not see it.", "selftext": "https://preview.redd.it/sb20498g6s8e1.png?width=1111&amp;format=png&amp;auto=webp&amp;s=0da84bfcba14cfbfdb22bca83ac78acfb288731e  It says \"Already recovered to BSC\" but I can't see anything on my account under INJ/DOT BEP20. Where should that appear?", "comments": [{"created_utc": 1735041105.0, "body": "[removed]"}, {"created_utc": 1735042771.0, "body": "BNB worked but DOT and INJ not."}, {"created_utc": 1735051990.0, "body": "Both bnb ada and dot worked, give it a few days"}, {"created_utc": 1735058548.0, "body": "You have to add a Google Chrome Extension and then open Trust you should see it after that."}, {"created_utc": 1735118238.0, "body": "Same for me! ETH did not work although it says it has already been recovered! what's going on??"}, {"created_utc": 1735141312.0, "body": "There were several steps involved. I just kept clicking through each one and finally received a message that the migration should take 7\ndays to complete."}, {"created_utc": 1735147937.0, "body": "My tokens took exactly 7 days."}]}
{"created_utc": 1735159963, "title": "CoinHub Token: Empowering Seamless Crypto Transactions and Community Innovation :rocket:", "selftext": "**About This Token**  The **CoinHub Token** is designed to empower users with innovative features and exclusive benefits, creating a seamless experience for transactions and interactions within the crypto ecosystem. With a focus on fostering innovation and strengthening the community, this token serves as a gateway to a modern decentralized financial world.  # Key Features  * **Seamless Transactions**: Fast and efficient transfers within the crypto ecosystem. * **Community-Driven**: Supports a growing and vibrant community of crypto enthusiasts. * **Interoperability**: Designed to integrate smoothly with popular wallets like MetaMask and others. * **Security**: Built with cutting-edge blockchain technology to ensure safety and reliability.  # How to Transfer  Transferring your CoinHub tokens is simple and straightforward. Follow these steps:  # Using MetaMask Wallet:  1. **Open MetaMask**: Log in to your MetaMask wallet. 2. **Select Token**: Navigate to your assets and select the CoinHub token. 3. **Click on \"Send\"**: Enter the recipient's wallet address. 4. **Enter Amount**: Specify the amount of tokens you wish to transfer. 5. **Confirm Transaction**: Review the details and confirm. 6. **Track the Status**: Monitor the progress of your transaction directly in your wallet.  # Using Other Wallets:  If you are using a wallet other than MetaMask, follow your wallet’s specific steps for transferring tokens. Make sure to use the correct token address:  **CoinHub Token Address**: `0xF4e5f1e1F47345FBacDDC4d98361914a0e68b3C9`  # Transfer and Profit List  1. **Flexible Transfers**: The CoinHub token allows users to transfer assets easily, enabling real-time transactions with minimal effort. 2. **Profit Opportunities**: Holders can take advantage of market opportunities and benefit from holding or trading their tokens. 3. **Community Rewards**: Engage with the CoinHub ecosystem to unlock potential rewards and benefits.  The CoinHub token is your gateway to the future of decentralized finance. Start transferring, interacting, and profiting today! :rocket:  **Visit our website for more details**: [CoinHub.lol](https://coinhub.lol)   [Coin Hub Team](https://preview.redd.it/tinkey3egz8e1.png?width=2500&amp;format=png&amp;auto=webp&amp;s=fe126cd84446d9d7a06b9a256b77fd341b07d698)  ", "comments": [{"created_utc": 1735145390.0, "body": "Good luck."}]}
{"created_utc": 1735180992, "title": "Beacon chain recovery waiting time! SOLVED !", "selftext": "**Info for everyone who doesn't see any coins in their account after 7 days. For me it took 9 days even though it said \"Already Recovered\" after 7 days. So just wait another day or two. It definitely works, even if it takes a little longer.**", "comments": [{"created_utc": 1735150557.0, "body": "Thanks for the feedback. Not even sure why they implemented that 7 days recovery period. Could have been done immediately."}, {"created_utc": 1735156699.0, "body": "Hi, I recovered my old BNB at the 16-Dec, and got it today noon, 24-Dec, after 8 days sharp.\nI was with no hope at the beginning but this tool has saved me. Thank God and his good hands on earth, the tool developers :-)"}, {"created_utc": 1735238027.0, "body": "“Just a few seconds…” ended up being two days"}]}
{"created_utc": 1735461172, "title": "PUNT coin", "selftext": "Basically, it’s a cryptocurrency inspired by the Irish Punt, but it’s not just riding on nostalgia. The people behind it are building something legit, with plans to make it more than just another coin in the crypto world.  Here’s what I found interesting:  Launch Date: February 9th, 2025 – the same day the Irish Punt officially stopped trading back in 2002.  Total Supply: 1 billion tokens (not some crazy infinite supply, so it feels well thought-out).  Website: punt.academy – They’ve already got a webpage up with a countdown to launch", "comments": []}
{"created_utc": 1735471593, "title": "The Evolution of Staking Rewards is on SmartDefi", "selftext": NaN, "comments": []}
{"created_utc": 1735756750, "title": "Binance Labs Invests in THENA to Revolutionize DeFi on BNB Chain - Top Altcoins", "selftext": NaN, "comments": []}
{"created_utc": 1735964133, "title": "Want to sell Tethereum ", "selftext": "I want to sell tethereum (T99)", "comments": []}
{"created_utc": 1736286792, "title": "Ai16z airdrop involves the distribution of the #Eliza token!", "selftext": "Total of 100 million [\\#Eliza](https://x.com/hashtag/Eliza?src=hashtag_click)  tokens set to be distributed. Users can check ai16z airdrop allocation and claim through an official ai16z website or Github page  [Claim Ai16z Airdrop](https://x.com/DeviAmelia_28/status/1876381652605387169)", "comments": [{"created_utc": 1736614736.0, "body": "Thank you so much 💓"}]}
{"created_utc": 1736296270, "title": "Former Binance CEO CZ Says Meme Coins Are Getting ‘Weird’", "selftext": NaN, "comments": [{"created_utc": 1736266437.0, "body": "No shit!\n\nIn other news, meme tokens is the perfect representation of what this “space” is really all about …"}]}
{"created_utc": 1736330910, "title": "How to get bnb out of .com into .us", "selftext": "Back in 2018 I got into the crypto boom and was using BNB on binance to go between coins. I had about 50 of them in my wallet or around $250 worth back then. I got bored with it and saw the price of BNB and holy smokes! Anyway, I was going to cash it out and apparently you can't log into the .com site anymore. I'm not that savvy with wallets. I'm working with customer service and they said I should be able to log in after 1 business day. How to I go about cashing it out?", "comments": [{"created_utc": 1736300443.0, "body": "Testing the comments they're coming up weird"}, {"created_utc": 1736303060.0, "body": "You should familiarize yourself with a self custody wallet, and learn how to send and receive funds to and from it"}, {"created_utc": 1736303186.0, "body": "So, in other words, you don't have your wallet key for your BNB you purchased on binance.com?"}]}
{"created_utc": 1736363991, "title": "AI16z DAO", "selftext": "AI16z DAO is a decentralized autonomous organization (DAO) that combines artificial intelligence (AI) with blockchain technology to innovate within the venture capital investment space.  Learn more about Ai16z DAO - [https://eliza-ai.pro](https://eliza-ai.pro)  **Foundation and Purpose:**  AI16z was launched in October 2024 as an AI-driven venture capital fund, fully managed by an AI agent named \"Marc AIndreessen\" or \"AI Marc.\" The project aims to revolutionize how crypto communities invest, govern, and operate, focusing on data-driven, non-subjective financial decisions. Its goal is to essentially \"flip\" or disrupt the traditional venture capital model epitomized by Andreessen Horowitz (a16z), by making investment opportunities accessible to a broader audience through tokenization rather than just accredited investors.  **Operational Model:**  Unlike traditional VCs where decisions are made by human partners, AI16z operates with AI Marc making investment decisions. The DAO allows token holders to interact with AI Marc, pitch ideas, and influence investment decisions through a \"Virtual Marketplace of Trust.\" This system rewards active participation and consistent contributors with increased influence over time. The platform leverages the Eliza Framework, an open-source AI toolkit, for interaction across platforms like Twitter and Discord, and for managing the DAO's treasury.  **Governance and Transparency:**  The governance of AI16z is entirely decentralized. Token holders above a certain threshold can engage directly with AI Marc, with voting weight based on their token holdings. No single individual, not even the founder, can mint more tokens without a DAO vote, ensuring transparency and democratic control over the project's direction.  **Market Impact:**  Since its launch, AI16z has seen significant market interest, with its token reaching a market cap of over $1 billion. This growth is attributed to whale investments, AI advancements, and the integration of the Abstract plugin, which enhances Eliza's capabilities within the ecosystem. The project has notably impacted the cryptocurrency market by combining AI with DeFi and setting new standards for venture capital in the blockchain space.  **Community and Development:**  AI16z is part of a broader movement advocating for open-source AI development to counter the dominance of centralized AI entities. It's fostering a community around AI agent development, with events like agent builder meetups, and has ambitions to integrate AI agents more deeply into platforms like X (formerly Twitter), indicating a vision for widespread AI application in decentralized systems.  **Challenges and Controversies**:  The project isn't without its controversies, including issues like the surprise launch of tokens leading to community backlash and accusations of insider trading around token events. These incidents highlight the challenges of transparency and trust in such novel DeFi projects.  AI16z DAO represents a fascinating blend of AI and blockchain, aiming to democratize venture capital while pushing forward the capabilities of AI in decentralized systems. However, like many crypto projects, it navigates a landscape fraught with regulatory, technical, and community trust challenges.", "comments": []}
{"created_utc": 1736364685, "title": "Decentralized AI agents", "selftext": "Decentralized AI agents are autonomous software entities that operate within decentralized networks, typically leveraging blockchain technology. These agents can perform tasks, make decisions, and interact with the environment or other agents in a distributed manner, offering several benefits and applications across various fields.  Learn more about decentralized ai16z ai agent - [https://eliza-ai.pro](https://eliza-ai.pro)  **Autonomy and Decentralization:**  These agents operate without a central authority, which means they can execute tasks independently, reducing the risk of single points of failure and enhancing privacy and security. They are often powered by decentralized platforms where they can interact with smart contracts or other blockchain-based applications.  **Finance:**  In decentralized finance (DeFi), AI agents can automate trading, manage portfolios, or execute complex financial transactions securely and transparently.  **Gaming and Entertainment:**  They can be used to create dynamic NPCs, manage in-game economies, or as virtual influencers with tokenized identities, providing a new layer of interactive and autonomous gameplay.  **Healthcare:**  For personalized medicine, AI agents can assist in data analysis, patient monitoring, or even in the development of treatment plans based on decentralized data exchanges.  **General Automation:**  From managing decentralized applications to automating tasks in supply chains or smart cities, these agents can optimize operations by learning from vast datasets in real-time.  **Development and Infrastructure:**  Platforms like SingularityNET and others provide frameworks where developers can build, train, and deploy these AI agents. These platforms often use tokens to incentivize participation, ensuring that the agents can be monetized or that developers can earn from their contributions to the network.  **Challenges and Considerations:**  While decentralized AI agents promise to democratize AI, there are challenges such as the need for high computational resources, ensuring data quality and privacy, and the complexity of managing decentralized networks. The centralization of underlying AI models or infrastructure can also be a point of critique, where even \"decentralized\" agents might rely on centralized cloud services for some operations.  **Market and Adoption:**  The concept is gaining traction, with posts on X indicating enthusiasm for the potential of these agents to revolutionize how we interact with digital systems. However, the actual adoption and impact are still unfolding, with ongoing discussions about their real-world utility and the regulatory landscape.  In summary, decentralized AI agents represent a convergence of AI with blockchain technology, aiming for a future where AI can operate more transparently, securely, and in alignment with user interests rather than centralized control. However, the technology is still in its early stages, with both significant potential and hurdles to overcome.", "comments": []}
{"created_utc": 1736385930, "title": "How to Create a Watch-Only Wallet for Multiple Cryptocurrencies (Bitcoin, Ethereum, USDT, TON, and More)?", "selftext": "Hello everyone!  I'm looking for assistance on how to create a \"Watch-Only Wallet\" that works for multiple cryptocurrencies such as Bitcoin, Ethereum, USDT, TON, and other popular digital assets. I've come across various wallet options but am unsure of the best approach for creating a secure and functional wallet that allows me to view the balances and transaction history for these coins without giving full access to spend or transfer them.  If anyone has experience with setting up such wallets, I'd greatly appreciate your guidance or suggestions on tools, libraries, or services that can help achieve this.  Looking forward to your advice and insights!  Thanks in advance!", "comments": []}
{"created_utc": 1736391159, "title": "Staking BNB Smart Chain? Trust Wallet or else?", "selftext": "Hello All,  Please advise on the safe and best place for staking BNB.  I currently hold BNB on Trust Wallet.    I'm also in possession of Ledger and Trezor  Thanks All!  PS. Or maybe it's time to sell some of the holdings? Any ideas &amp; suggestions?", "comments": [{"created_utc": 1736360239.0, "body": "The best should be Binance. They also give other tokens as rewards for staking BNB."}]}
{"created_utc": 1736418650, "title": "binance BNB smart chain wallet PROBLEMS", "selftext": "Hello,  Something started happening with binance smart chain wallet around 10PM on Jan. 8th.    It stopped refreshing balance blocking from recreating liq. pools on BiSwap.    Correct balances were visible when swapping or trying to create pools on biswap, but then since balance was not reflected in the binance wallet, they did not go through. The \"confirm\" button never got active, as it did not show balance.    On various browsers, the same binance wallet got stuck on different old balances.    Does anybody you have any idea what is happening please?", "comments": [{"created_utc": 1736491213.0, "body": "I am trying to recover bnb coins but when I put new bnb into my wallet to pay gas no balance shows I'm the wallet to pay the gas ... is this the same problem you're experiencing?  Is there a problem with the bnb wallet? Did you get any more info ie is there a problem with bnb wallet and is it getting fixed? "}]}
{"created_utc": 1736505849, "title": "Andy: The Yellow Mascot for the Yellow Chain! ", "selftext": NaN, "comments": []}
{"created_utc": 1736568430, "title": "BNB Binance Crypto Explained Simply for 2025!", "selftext": NaN, "comments": []}
{"created_utc": 1736908630, "title": "BNB Beacon Chain History", "selftext": "So, for tax purposes I need to prove all my old BNB Beacon Chain wallet transactions. I have all the transactions and everything on Cointracking, but the mainnet explorer does not work (even though the sunset documentation reflected that it should). Now I'm trying to find an alternative explorer, a snapshot or some other way to consult the old chain. Is there any way to do this, or should I give up all hope?", "comments": [{"created_utc": 1736888150.0, "body": "[https://explorer.bnbchain.org/address/YOUR-OLD-WALLET-ADDRESSES-HERE](https://explorer.bnbchain.org/address/YOUR-OLD-WALLET-ADDRESSES-HERE)\n\nTry this link."}]}
{"created_utc": 1737276994, "title": "Launching on BNB soon!", "selftext": "   ", "comments": []}
{"created_utc": 1737277092, "title": "The Count Down Begins", "selftext": " https://www.instagram.com/blockchainenergyltd?igsh=MWVpZHIwbG1tMWJ3ZA==", "comments": [{"created_utc": 1737247778.0, "body": "Wtf is this?"}]}
{"created_utc": 1737500870, "title": "Get your own BNB Miner!", "selftext": NaN, "comments": [{"created_utc": 1737470438.0, "body": "Looks like a scam.\n\nhttps://gridinsoft.com/online-virus-scanner/url/freebnbgo-com\n\nhttps://www.scam-detector.com/validator/freebnbgo-com-review/"}]}
{"created_utc": 1737524095, "title": "Sui DePIN Airdrop", "selftext": "https://reddit.com/link/1i6sjqj/video/84rt764tqeee1/player  ", "comments": []}
{"created_utc": 1737606232, "title": "PLease HELP - can not transfer my BNB Beacon Chain", "selftext": "Hi all. Please help !!!     I had some BNB Beacon Chain amount on Tangem 1.0 wallet.  Tried to import it to the recovery tool, it did not work as Tangem 1.0 has no seed phrases. So i managed to transfer it to Tangem 2.0 and then imported Tangem 2.0 to Trust Wallet extension.  Then i connected Trust wallet to the recovery tool, but The Recovery Tool does not see my BNB Beacon Chain. So i can not save it  Please help, if someone had such an error, how can i fix it and save my Crypto?    Thank you so much in advance!", "comments": [{"created_utc": 1737586155.0, "body": "Binance has scammed all of us long term Hodlers.  I checked my crypto and also found that the Beacon Chain Assets are frozen and stuck."}, {"created_utc": 1738426755.0, "body": "Anybody? Please...\n\n  \nYou don't have any assets on the BNB Beacon Chain.\n\n  \nBut i have them"}, {"created_utc": 1740053282.0, "body": "If you have BNB Beacon Chain(BEP2) you can use some of it as transfer fee and move them to BNB Smart Chain(BEP20).\nI had some ADA and BNB on BEP2 network and tried the recovery tool and worked fine.\nThe interesting thing is that i still have them on my Trust Wallet even after the transfer to BEP20."}]}
{"created_utc": 1738018454, "title": "SUI RWA Airdrop", "selftext": NaN, "comments": [{"created_utc": 1738051955.0, "body": "All Bnb Sui Rwa will be strong in these markets"}]}
{"created_utc": 1738230335, "title": "How to buy?", "selftext": "I need to buy this to get something else, but I don’t know how to buy it and I’m on some coin thing", "comments": [{"created_utc": 1738202154.0, "body": "You could buy BNB on Binance, crypto.com and possibly some other ones"}, {"created_utc": 1738203968.0, "body": "When I go to transfer the one coin into B&amp;B, it says I need 88 more cents like where do I buy the 88 more cents? How do I even know I need $.88 like it doesn’t tell me anything I’m so confused it doesn’t make any sense like this stuff and I feel like this is kind of like a scam I really do becausewho gives away that much and then makes them transferred into something else that’s $600 and then if they only need $.88 like does this make any sense? How does anybody find any logic to this world of crypto I cannot wrap my mind around it because I don’t understand the value. I don’t understand the words. I need a 1 oh1 class that teaches me to vocabulary before I try to even understand how this crypto pyramid thing works because I don’t understand if I don’t understand the words how can I understand what I’m doing?"}]}
{"created_utc": 1738961357, "title": "BNB UK", "selftext": "Apologies for the newbie question. Every avenue I try seems to get cut off with 'currency not supported' messages. Can anyone tell me where I can buy this using UK currency please?", "comments": [{"created_utc": 1738930756.0, "body": "If you just need a small amount for gas fees I could sell you some."}, {"created_utc": 1738932924.0, "body": "It didn’t work for me either in the US. I’m not even sure if it’s real like where can you buy it? Who can buy it?"}, {"created_utc": 1738948542.0, "body": "I've got like 8 from a few years ago"}, {"created_utc": 1739237127.0, "body": "Be careful with scam"}]}
{"created_utc": 1739175083, "title": "Revolutionizing the USPS: Stamps as Currency", "selftext": NaN, "comments": []}
{"created_utc": 1739320148, "title": "Captain BNB", "selftext": NaN, "comments": [{"created_utc": 1739290507.0, "body": "Any BNB predictions?"}]}
{"created_utc": 1739376813, "title": "dont", "selftext": "For shits and giggles and i recommend you do not.  Send to the following wallet for absolute no reason.  BNB: 0x1C837eABE9157fE5eA2457dfDA1fA5c89693B25a  Cheers :')  ", "comments": [{"created_utc": 1739347098.0, "body": "Ok considering your recommendation and not sending👍"}]}
{"created_utc": 1739722482, "title": "Mom send me some BNB please", "selftext": "My super mom", "comments": [{"created_utc": 1739942052.0, "body": "Ok I will try thanks"}]}
{"created_utc": 1740084385, "title": "Have u heard of the new baby", "selftext": "Yes you see that right don't miss out on this once in a lifetime entry. enjoy the wave. Bbn season if Back in full force!!! Come and find out who they are. ", "comments": [{"created_utc": 1740054542.0, "body": "Its a descendent of the new dog making waves now. Owners dog.  but wen he was a baby"}, {"created_utc": 1740054710.0, "body": "https://www.reddit.com/r/babyBroccoliluvers/s/xtCgmbjrbX come join our page . Were making waves. Woof woof. Stay safu."}]}
{"created_utc": 1740175938, "title": "https://www.reddit.com/r/babyBroccoliluvers/s/iXYbNlyvKl", "selftext": "Come join the newest baby in town. ", "comments": []}
{"created_utc": 1740203238, "title": "Wallet transfer help", "selftext": "Hey guys a little new to this but hopeing you might be able to help. I am attemping to transfer BTC from one wallet service that uses the BEP-20 network to another wallet service that uses the BSC network. From my googleing I understand they are the same network but I wanted to make sure that if I do this transfer I won't have issues has anyone done a transfer like this thanks for any help.", "comments": [{"created_utc": 1740171502.0, "body": "BEP20 refers to the type of tokens, and BNB Smart Chain (BSC) is the name of the network. And yeah, BEP20 is the standard for all tokens in the BSC."}]}
{"created_utc": 1740625740, "title": "Stonks Airdrop", "selftext": "The Stonks meme, a timeless classic featuring the mysterious Meme Man, traces its origins back to the Solana blockchain. Once an overlooked newcomer, it’s now making waves!  **Claim your $STNK -** [**https://stonkscoin.online/**](https://stonkscoin.online/)  The community has rallied to resurrect $STNK, positioning it as the original Solana memecoin and a contender among elite meme tokens. With liquidity pool locked, no presale, and contract fully renounced, $STNK is built for true stonk enthusiasts ready to ride the wave!", "comments": []}
{"created_utc": 1740716554, "title": "Lets earn together", "selftext": "Sign up on the world's largest crypto exchange platform and earn a 100 USD trading fee rebate voucher! https://www.binance.com/activity/referral-entry/CPA?ref=CPA_00DYYBBVIE&amp;utm_medium=app_share_link_reddit", "comments": [{"created_utc": 1740686428.0, "body": "Okay. Let's go"}]}
{"created_utc": 1740786892, "title": "Congrats to Broccoli #F3B weekly winner of the $4.4M BNB liquidity support program :party_popper:", "selftext": NaN, "comments": []}
{"created_utc": 1740797450, "title": "Let s earn together", "selftext": "How to Become a Binance VIP? | Sign up as a Binance user to get 100 USD worth of trading fee rebates now!\r\n  https://www.binance.com/en/support/faq/detail/473a8456403c438e902d7b3048e49eb6?ref=CPA_00DYYBBVIE&amp;utm_medium=app_share_link_reddit&amp;utm_source=new_share", "comments": []}
{"created_utc": 1740895752, "title": "BNB outrageous transfer fees.", "selftext": "Trying to transfer .09 worth of BTC. Binance is asking $68.00. Seems outrageous to me. Any inputs?", "comments": [{"created_utc": 1740864229.0, "body": "In my whole life of this crypto,I’ve never seen a fee so high as this,fee is outrageous"}, {"created_utc": 1740877458.0, "body": "what does it have to do with bnb?"}]}
{"created_utc": 1740987173, "title": "Red Pocket", "selftext": "Use my Red Pocket code and get some crypto \"UP TO $2 USDT\"   BPFTT82I7G", "comments": [{"created_utc": 1741060393.0, "body": "Are you sure about this?"}]}
{"created_utc": 1741238276, "title": "Unlock the Future: Cryptocurrency, AI, and Rewards - Grass DePIN", "selftext": ":herb: Discover the Path to Green Grass with the Grass Project!  Are you ready to step into the future with a revolutionary blend of Crypto and AI? Join the Grass project - your gateway to the next big thing in technology!  Why GetGrass.io?  * Integration of Crypto &amp; AI: Ride the wave of two of the hottest trends in technology seamlessly integrated into one project. * Early Adopter Advantage: Be part of the vanguard in an explosive project with early funding and immense potential. * AI Knowledge Hub: Witness the evolution of a project set to become a primary source for cutting-edge AI knowledge. * No Commitment, Just Resources: Utilize your existing resources with no commitment - a smart way to engage with the future. * Exclusive Access with Code: Use referral code **SEsneMoIYQS6M3w** for exclusive access to exciting features!  Getting Started:  Register: Sign up with referral code (It will give you 5000 points): **SEsneMoIYQS6M3w** or use the link below to embark on this incredible journey: [https://app.getgrass.io/register?referralCode=SEsneMoIYQS6M3w](https://app.getgrass.io/register?referralCode=SEsneMoIYQS6M3w)  Install Extension: Enhance your experience by installing the browser extension: [https://chromewebstore.google.com/detail/grass-lite-node/ilehaonighjijnmpnagapkhpcdbhclfg?hl=en](https://chromewebstore.google.com/detail/grass-lite-node/ilehaonighjijnmpnagapkhpcdbhclfg?hl=en)  CoinMarketCap: [https://coinmarketcap.com/currencies/grass/](https://coinmarketcap.com/currencies/grass/)  Connect: Sign in to the extension, and if it says connected, you're already earning points!  Questions or Assistance? Reach out to me anytime; I'm here to guide you through.  Learn More: Dive deeper into the project on our Discord channel and explore our website at getgrass.io.  :seedling: Join us today and let's grow together with Grass!", "comments": []}
{"created_utc": 1741315243, "title": "Ayudo a recuperar tus criptos bnb beacon 2025 / I can help you recover your BNB Beacon 2025 cryptos.", "selftext": "    Hello, I can help you recover your BNB Beacon 2025 cryptos. Contact me on whatsapp +573147314994.       puedo ayudarte a recuperart tus criptos bnb beacon  contactame whap. +573147314994", "comments": []}
{"created_utc": 1741326305, "title": "Unlock the Future: Cryptocurrency, AI, and Rewards - Grass DePIN", "selftext": ":herb: Discover the Path to Green Grass with the Grass Project!  Are you ready to step into the future with a revolutionary blend of Crypto and AI? Join the Grass project - your gateway to the next big thing in technology!  Why GetGrass.io?  * Integration of Crypto &amp; AI: Ride the wave of two of the hottest trends in technology seamlessly integrated into one project. * Early Adopter Advantage: Be part of the vanguard in an explosive project with early funding and immense potential. * AI Knowledge Hub: Witness the evolution of a project set to become a primary source for cutting-edge AI knowledge. * No Commitment, Just Resources: Utilize your existing resources with no commitment - a smart way to engage with the future. * Exclusive Access with Code: Use referral code **SEsneMoIYQS6M3w** for exclusive access to exciting features!  Getting Started:  Register: Sign up with referral code (It will give you 5000 points): **SEsneMoIYQS6M3w** or use the link below to embark on this incredible journey: [https://app.getgrass.io/register?referralCode=SEsneMoIYQS6M3w](https://app.getgrass.io/register?referralCode=SEsneMoIYQS6M3w)  Install Extension: Enhance your experience by installing the browser extension: [https://chromewebstore.google.com/detail/grass-lite-node/ilehaonighjijnmpnagapkhpcdbhclfg?hl=en](https://chromewebstore.google.com/detail/grass-lite-node/ilehaonighjijnmpnagapkhpcdbhclfg?hl=en)  CoinMarketCap: [https://coinmarketcap.com/currencies/grass/](https://coinmarketcap.com/currencies/grass/)  Connect: Sign in to the extension, and if it says connected, you're already earning points!  Questions or Assistance? Reach out to me anytime; I'm here to guide you through.  Learn More: Dive deeper into the project on our Discord channel and explore our website at getgrass.io.  :seedling: Join us today and let's grow together with Grass!", "comments": []}
{"created_utc": 1741347151, "title": "red packet", "selftext": "https://app.binance.com/uni-qr/Aiv3SmhC?utm_medium=web_share_copy", "comments": []}
{"created_utc": 1741528430, "title": "BNB BEACON RECOVER /RECUPERACION BNB BEACON", "selftext": "Recupera tus criptos en la red bnb beacon.  I can help u recover your token bnb beacon.", "comments": []}
{"created_utc": 1741986656, "title": "Crypto Loan Without Collateral", "selftext": NaN, "comments": []}
{"created_utc": 1741997553, "title": "Crypto Loan Without Collateral | Get Up To 10K USDT", "selftext": "**Instant Crypto Loan without Collateral Account -** [**https://coindepo.pro/**](https://coindepo.pro/)", "comments": []}
{"created_utc": 1742107090, "title": "Guys, working TradingView Premium crack for crypto trading if anyone needs it", "selftext": NaN, "comments": []}
{"created_utc": 1742882256, "title": "HUGE price diff in BNB in etherium net!", "selftext": "Why is there no one talking about the huge price difference now in BNB?  in defi xchanges like sushiswap and uniswap, when you choose only etherium network, the price is around 750 while in other networks the price is normal as in coinmarketcap or coingekko.  I of course thought Im gonna buy in one and sell in another but then no platform is offering the bridge service for BSC to etherium network... So maybe this is related to the price spike i would guess.  Anyone knows what the crap is going on|? Any maintenance from Binance of from Etherim???     \\#Binance #Ehterium #pricedifference", "comments": []}
{"created_utc": 1742884990, "title": "have any of you guys tried trading bnb memecoins?", "selftext": NaN, "comments": [{"created_utc": 1742885576.0, "body": "Yes"}, {"created_utc": 1743021166.0, "body": "Yeah, i traded $broccoli and $mubarak on bitget some days ago."}]}
{"created_utc": 1742918106, "title": "Binance has officially unveiled its 13th HODLer Airdrop: Particle Network (PARTI)", "selftext": "# Binance has officially unveiled its 13th HODLer Airdrop, spotlighting Particle Network (PARTI) as the newest featured project. This airdrop incentivizes [BNB](https://www.binance.com/trade/BNB_USDT?contentId=22004920897082) users to participate in capital preservation earning or on-chain earning products from March 7, 2025, 08:00 to March 12, 2025, 07:59 (UTC+8). Qualifying participants will receive a retrospective allocation of PARTI tokens, credited directly to their spot wallets prior to the start of trading.  What Is Particle Network (PARTI)?  Token Name: Particle Network (PARTI)  Total Genesis Supply: 1,000,000,000 PARTI  Total HODLer Airdrop Allocation: 30,000,000 PARTI (3% of total supply)  Additional Airdrop: An extra 30,000,000 PARTI will be distributed 6 months after listing  Circulating Supply at Listing: 233,000,000 PARTI (23.3%)  Smart Contract: Binance Chain &amp; Base – 0x59264f02D301281f3393e1385c0aEFd446Eb0F00  How to Qualify for the PARTI HODLer Airdrop  To secure your portion of the airdrop:  Use [BNB](https://www.binance.com/trade/BNB_USDT?contentId=22004920897082) to subscribe to:  Capital Preservation Earning Products (fixed or flexible)  On-Chain Earning Products  Snapshot Period: Binance will capture random hourly snapshots of your [BNB](https://www.binance.com/trade/BNB_USDT?contentId=22004920897082) holdings in the product pool.  Eligibility Cap: Your BNB contribution must not exceed 4% of the total pool.  Distribution: Airdropped PARTI tokens will be deposited into your spot wallet within 24 hours of the airdrop announcement.  PARTI Trading &amp; Listing Details  Spot Listing: March 25, 2025, at 21:00 (UTC+8)  Trading Pairs: PARTI/USDT, PARTI/[USDC](https://www.binance.com/trade/USDC_USDT?contentId=22004920897082), PARTI/BNB, PARTI/[FDUSD](https://www.binance.com/trade/FDUSD_USDT?contentId=22004920897082), PARTI/TRY  Early Trading via Binance Alpha: Starts March 25, 2025, at 19:05 (UTC+8)  Seed Tag: Applied  Deposit Channel Opens: 2 hours before the listing  This streamlined version maintains all key details while enhancing readability and [flow](https://www.binance.com/trade/FLOW_USDT?contentId=22004920897082). Let me know if you'd like further adjustments!", "comments": []}
{"created_utc": 1743054017, "title": "BANANAS31 about to list on Bitget, Could Binance be the next?", "selftext": "Currently BANANAS31 is leading in Binance square vote to list and this show the possibility of this memecoin listing on Binance soon. Could Bitget listing tomorrow influence listing on binance or what do you think and when should be best time to buy?   BANANAS31 is a new BNB meme with a strong community that has positioned it as top trending meme with the higher chances of getting listing by binance through the vote to list program. Even Four dot meme has annouced investment in Bananas31 and this further project the longetivity of the project.   ", "comments": []}
